/*KakaoMap API*/

// 데이터 파싱하지 않고 데이터를 하나하나 다 입력 



/*지도 생성*/
var mapContainer = document.getElementById('map'), // 지도를 표시할 div 
    mapOption = {
        center: new kakao.maps.LatLng(35.136198, 129.103850), // 지도의 중심좌표
        level: 4, // 지도의 확대 레벨
        mapTypeId : kakao.maps.MapTypeId.ROADMAP // 지도종류
    }; 

// 지도를 생성한다 
var map = new kakao.maps.Map(mapContainer, mapOption); 






/*마커*/
//마커를 담을 배열
var markers = [];

// 마커 클러스터러를 생성합니다 
var clusterer = new kakao.maps.MarkerClusterer({
  map: map, // 마커들을 클러스터로 관리하고 표시할 지도 객체 
  averageCenter: true, // 클러스터에 포함된 마커들의 평균 위치를 클러스터 마커 위치로 설정 
  minLevel: 0.1 // 클러스터 할 최소 지도 레벨 
});

//마커 이미지
var image = new Image();
    imageSrc = './img/붕어빵.png', // 마커이미지의 주소입니다    
    imageSize = new kakao.maps.Size(64, 64), // 마커이미지의 크기입니다
    imageOption = {offset: new kakao.maps.Point(27, 64)}; // 마커이미지의 옵션입니다. 마커의 좌표와 일치시킬 이미지 안에서의 좌표를 설정합니다.

// 마커의 이미지정보를 가지고 있는 마커이미지를 생성합니다
var markerImage = new kakao.maps.MarkerImage(imageSrc, imageSize, imageOption),
    markerPosition = new kakao.maps.LatLng(35.136198, 129.103850); // 마커가 표시될 위치입니다

//마커 생성 반복//
var places = [
    [35.136198, 129.103850, '<div class="infowindow">부경대학교 대연캠퍼스</div>'],

    //중학교
    [35.14844865940511, 129.0364712129605, '<div class="infowindow">가야여자중학교<br>부산광역시 부산진구 엄광로182번길 15-25</div>'],
    [35.12198991716638, 129.088978326452, '<div class="infowindow">감만중학교<br>부산광역시 남구 홍곡로 313-14</div>'],
    [35.1637739536621, 129.03269965528915, '<div class="infowindow">개금여자중학교<br>부산광역시 부산진구 백양대로136번길 75</div>'],
    [35.14844865940511, 129.0364712129605, '<div class="infowindow">개림중학교<br>부산광역시 부산진구 백양대로300번길 46</div>'],
    [35.12372177237779, 129.0423562792001, '<div class="infowindow">경남여자중학교<br>부산광역시 동구 초량중로 142</div>'],
    [35.162290557661684, 129.0300202552891, '<div class="infowindow">광무여자중학교<br>부산광역시 부산진구 백양관문로 31</div>'],
    [35.13641008577305, 129.10521582064854, '<div class="infowindow">남천중학교<br>부산광역시 남구 황령대로492번길 71</div>'],
    [35.13249695359055, 129.0841930701368, '<div class="infowindow">대연중학교<br>부산광역시 남구 천제등로16번길 81</div>'],
    [35.128746452787155, 129.10316708667258, '<div class="infowindow">대천중학교<br>부산광역시 남구 신선로 491</div>'],

    [35.177479291244694, 129.0316550517889, '<div class="infowindow">동양중학교<br>부산광역시 부산진구 백양산로 96</div>'],
    [35.17050216090276, 129.0428421600435, '<div class="infowindow">동평여자중학교<br>부산광역시 부산진구 백양순환로 119</div>'],
    [35.17114277097001, 129.04189349479026, '<div class="infowindow">동평중학교<br>부산광역시 부산진구 백양순환로119번길 12-31</div>'],
    [35.11874111166649, 129.0857457129419, '<div class="infowindow">동항중학교<br>부산광역시 남구 양지골로 248</div>'],
    [35.142112246279694, 129.06856512102362, '<div class="infowindow">문현여자중학교<br>부산광역시 남구 고동골로59번길 46</div>'],
    [35.146999116904205, 129.03282411727452, '<div class="infowindow">개성중학교<br>부산광역시 부산진구 엄광로 176-12</div>'],
    [35.16733109700794, 129.0234068536909, '<div class="infowindow">부산국제중학교<br>부산광역시 부산진구 백양관문로 105-70</div>'],
    [35.125418082815415, 129.03636408434846, '<div class="infowindow">부산서중학교<br>부산광역시 동구 홍곡남로 29</div>'],
    [35.122308237906786, 129.03698581277865, '<div class="infowindow">부산중학교<br>부산광역시 동구 초량로40번길 29</div>'],
    [35.15418324197856, 129.06918741075185, '<div class="infowindow">부산진여자중학교<br>부산광역시 부산진구 동성로 34</div>'],

    [35.16417404162821, 129.0554622713467, '<div class="infowindow">부산진중학교<br>부산광역시 부산진구 시민공원로 50</div>'],
    [35.12935006823107, 129.1147601682373, '<div class="infowindow">분포중학교<br>부산광역시 남구 분포로 51</div>'],
    [35.122192552945585, 129.0947748192067, '<div class="infowindow">석포여자중학교<br>부산광역시 남구 유엔평화로126번길 63</div>'],
    [35.14112115754456, 129.066228507432, '<div class="infowindow">성동중학교<br>부산광역시 남구 남동천로 38</div>'],
    [35.170438450152176, 129.0811861737372, '<div class="infowindow">양동여자중학교<br>부산광역시 부산진구 황령산로605번길 35-32</div>'],
    [35.104325403527184, 129.11496473133926, '<div class="infowindow">오륙도중학교<br>부산광역시 남구 오륙도로 60</div>'],
    [35.12454606206503, 129.1069671323724, '<div class="infowindow">용문중학교<br>부산광역시 남구 동명로101번길 93</div>'],
    [35.119265762817385, 129.11693463442643, '<div class="infowindow">용호중학교<br>부산광역시 남구 동명로 185-17</div>'],
    [35.17978928445963, 129.04411686408685, '<div class="infowindow">초연중학교<br>부산광역시 부산진구 초읍천로77번가길 9</div>'],
    [35.180821377417715, 129.05649619892355, '<div class="infowindow">초읍중학교<br>부산광역시 부산진구 성지로94번길 71</div>'],

    [35.15291499173272, 129.06886132082275, '<div class="infowindow">덕명여자중학교<br>부산광역시 부산진구 봉수로 13</div>'],
    [35.16499784829321, 129.071039394956, '<div class="infowindow">동의중학교<br>부산광역시 부산진구 진남로462번길 16</div>'],
    [35.13307344613711, 129.04122116933357, '<div class="infowindow">부산동여자중학교<br>부산광역시 동구 망양로 773</div>'],
    [35.15342376295624, 129.07092865095947, '<div class="infowindow">부산동중학교<br>부산광역시 부산진구 동성로30번길 36</div>'],
    [35.160375395979294, 129.05222997368958, '<div class="infowindow">서면중학교<br>부산광역시 부산진구 가야대로747번길 53</div>'],
    [35.121126960202545, 129.03441471845318, '<div class="infowindow">선화여자중학교<br>부산광역시 동구 초량로80번길 5</div>'],
    [35.16227894117313, 129.06641718104117, '<div class="infowindow">항도중학교<br>부산광역시 부산진구 동성로118번길 44</div>'],
    [35.13981319870383, 129.08263618271636, '<div class="infowindow">해연중학교<br>부산광역시 남구 진남로110번길 25</div>'],
    [35.18780219322418, 129.06343073477277, '<div class="infowindow">거제여자중학교<br>부산광역시 연제구 금용로 43</div>'],
    [35.24902729545423, 129.08597714046385, '<div class="infowindow">구서여자중학교<br>부산광역시 금정구 금강로453번길 26-12</div>'],

    [35.22110553163319, 129.10563369389018, '<div class="infowindow">금사중학교<br>부산광역시 금정구 서금로 53-7</div>'],
    [35.233700230776925, 129.09553847622743, '<div class="infowindow">금양중학교<br>부산광역시 금정구 기찰로22번길 37</div>'],
    [35.259730571323594, 129.09378414204474, '<div class="infowindow">남산중학교<br>부산광역시 금정구 금단로 114</div>'],
    [35.192739538294084, 129.11171250598633, '<div class="infowindow">남일중학교<br>부산광역시 동래구 온천천로531번길 49</div>'],
    [35.209451124878264, 129.07977771455603, '<div class="infowindow">동래중학교<br>부산광역시 동래구 충렬대로181번길 109</div>'],
    [35.205992309848696, 129.09765985511675, '<div class="infowindow">동신중학교<br>부산광역시 동래구 충렬사로51번길 38</div>'],
    [35.21871931762787, 129.09228481721811, '<div class="infowindow">동현중학교<br>부산광역시 금정구 서동로 50</div>'],
    [35.22344680843282, 129.09524046708339, '<div class="infowindow">부곡여자중학교<br>부산광역시 금정구 가마실로 56</div>'],
    [35.231250157839256, 129.0961016337354, '<div class="infowindow">부곡중학교<br>부산광역시 금정구 동부곡로15번길 102-20</div>'],
    [35.20360805644713, 129.07703869387217, '<div class="infowindow">부산내성중학교<br>부산광역시 동래구 중앙대로 1297</div>'],

    [35.19430033682965, 129.05538953467433, '<div class="infowindow">사직여자중학교<br>부산광역시 동래구 사직로 91</div>'],
    [35.199462418941195, 129.05157222690946, '<div class="infowindow">사직중학교<br>부산광역시 동래구 쇠미로51번길 30/div>'],
    [35.191405323787016, 129.10937523002247, '<div class="infowindow">안락중학교<br>부산광역시 동래구 온천천로 513</div>'],
    [35.19578920049053, 129.07031493485667, '<div class="infowindow">여명중학교<br>부산광역시 동래구 여고로52번길 </div>'],
    [35.18458955465543, 129.08955734842544, '<div class="infowindow">연산중학교<br>부산광역시 연제구 고분로56번길 39</div>'],
    [35.18468278599528, 129.09742956013642, '<div class="infowindow">연일중학교<br>부산광역시 연제구 고분로 138</div>'],
    [35.178742335503394, 129.09012229549336, '<div class="infowindow">연제중학교<br>부산광역시 연제구 쌍미천로 62</div>'],
    [35.18436528728537, 129.1014542810329, '<div class="infowindow">연천중학교<br>부산광역시 연제구 톳고개로 16</div>'],
    [35.20437084833034, 129.0593236399195, '<div class="infowindow">온천중학교<br>부산광역시 동래구 쇠미로129번길 28</div>'],
    [35.214697524719334, 129.0764169167819, '<div class="infowindow">유락여자중학교<br>부산광역시 동래구 금강로 51</div>'],

    [35.22883206234084, 129.07816051097706, '<div class="infowindow">장전중학교<br>부산광역시 금정구 금샘로18번길 39</div>'],
    [35.202972765331275, 129.10840195828112, '<div class="infowindow">충렬중학교<br>부산광역시 동래구 명장로64번길 45</div>'],
    [35.181879713095626, 129.1113100026739, '<div class="infowindow">토현중학교<br>부산광역시 연제구 토현로 47</div>'],
    [35.18308100422876, 129.06698522462952, '<div class="infowindow">거성중학교<br>부산광역시 연제구 해맞이로109번길 61</div>'],
    [35.272037315210916, 129.09420113159473, '<div class="infowindow">금정중학교<br>부산광역시 금정구 중앙대로 2104</div>'],
    [35.245186663243075, 129.09512865903773, '<div class="infowindow">동래여자중학교<br>부산광역시 금정구 체육공원로 20</div>'],
    [35.21706212693943, 129.08880839852492, '<div class="infowindow">동해중학교<br>부산광역시 동래구 시실로 19-39</div>'],
    [35.243931538896895, 129.09484494481765, '<div class="infowindow">부산예술중학교<br>부산광역시 금정구 체육공원로 20</div>'],
    [35.25519592876752, 129.10400443577603, '<div class="infowindow">브니엘예술중학교<br>부산광역시 금정구 체육공원로 154</div>'],
    [35.19467863067109, 129.07835035528672, '<div class="infowindow">이사벨중학교<br>부산광역시 연제구 중앙대로 1197</div>'],
    
    [35.20474884187699, 129.09631481069815, '<div class="infowindow">학산여자중학교<br>부산광역시 동래구 충렬사로51번길 61</div>'],
    [35.20600217152555, 129.09764797032778, '<div class="infowindow">동신중학교<br>부산광역시 동래구 충렬사로51번길 61</div>'],
    [35.204620365611014, 129.1108533920339, '<div class="infowindow">혜화여자중학교<br>부산광역시 동래구 명장로67번길 14-22</div>'],
    [35.1902304649962, 128.90366254814768, '<div class="infowindow">가락중학교<br>부산광역시 강서구 가락대로 1405</div>'],
    [35.204115164175455, 128.99847335595322, '<div class="infowindow">가람중학교<br>부산광역시 북구 낙동북로663번길 55</div>'],
    [35.10067715092249, 128.9282859620233, '<div class="infowindow">경일중학교<br>부산광역시 강서구 명지국제6로 149</div>'],
    [35.19546743116079, 128.99724952254462, '<div class="infowindow">구남중학교<br>부산광역시 북구 백양대로1016번길 38</div>'],
    [35.19452430867016, 128.99659357788065, '<div class="infowindow">구포중학교<br>부산광역시 북구 백양대로1016번다길 31</div>'],
    [35.26063886208682, 129.01693401085325, '<div class="infowindow">금곡중학교<br>부산광역시 북구 효열로162번길 3</div>'],
    [35.243709693794244, 129.01258091403355, '<div class="infowindow">금명중학교<br>부산광역시 북구 화명신도시로 210-1</div>'],
    
    [35.216101177805605, 128.96553677644218, '<div class="infowindow">낙동중학교<br>부산광역시 강서구 대저로 115</div>'],
    [35.24235073171505, 129.02173025207827, '<div class="infowindow">대천리중학교<br>부산광역시 북구 산성로 87-15</div>'],
    [35.05140680433627, 128.82955644620307, '<div class="infowindow">덕문중학교<br>부산광역시 강서구 동선길 144</div>'],
    [35.217659521569395, 129.0116284850167, '<div class="infowindow">덕천여자중학교<br>부산광역시 북구 의성로47번길 45-4</div>'],
    [35.21441790494618, 129.01186213712248, '<div class="infowindow">덕천중학교<br>부산광역시 북구 만덕대로65번길 50</div>'],
    [35.169930020940015, 128.98608394836077, '<div class="infowindow">덕포여자중학교<br>부산광역시 사상구 사상로310번길 110</div>'],
    [35.14593999412694, 129.0040097525462, '<div class="infowindow">동주중학교<br>부산광역시 사상구 주례로 107</div>'],
    [35.214790260865286, 129.0317951296968, '<div class="infowindow">만덕중학교<br>부산광역시 북구 만덕1로 52</div>'],
    [35.10252339730426, 128.92583400773316, '<div class="infowindow">명지중학교<br>부산광역시 강서구 명지국제6로318번길 54</div>'],
    [35.2398280822692, 129.00985726670763, '<div class="infowindow">명진중학교<br>부산광역시 북구 학사로 192</div>'],
    
    [35.08030670276147, 128.89873200011286, '<div class="infowindow">명호중학교<br>부산광역시 강서구 명지오션시티2로 100</div>'],
    [35.18500900446632, 129.00299259663385, '<div class="infowindow">모동중학교<br>부산광역시 사상구 모라로192번길 51</div>'],
    [35.19009528564701, 128.99249226390566, '<div class="infowindow">모라중학교<br>부산광역시 사상구 백양대로 936</div>'],
    [35.2072170273313, 129.04103632739566, '<div class="infowindow">백양중학교<br>부산광역시 북구 상리로 70</div>'],
    [35.20294574229934, 129.03106471126162, '<div class="infowindow">신덕중학교<br>부산광역시 북구 함박봉로140번가길 27</div>'],
    [35.082030248982896, 128.87679034587777, '<div class="infowindow">신호중학교<br>부산광역시 강서구 신호산단2로 76</div>'],
    [35.204490320972006, 129.01364024039938, '<div class="infowindow">양덕여자중학교<br>부산광역시 북구 시랑로21번길 178</div>'],
    [35.13530807053669, 128.9753638669155, '<div class="infowindow">엄궁중학교<br>부산광역시 사상구 대동로 56</div>'],
    [35.230126714110234, 129.00818843098727, '<div class="infowindow">용수중학교<br>부산광역시 북구 금곡대로229번길 88</div>'],
    [35.15655820753876, 128.99549312265898, '<div class="infowindow">주감중학교<br>부산광역시 사상구 백양대로 530</div>'],
    
    [35.148595708193724, 129.00694595268445, '<div class="infowindow">주례여자중학교<br>부산광역시 사상구 가야대로306번길 55</div>'],
    [35.14827114800369, 129.0139416162664, '<div class="infowindow">주례중학교<br>부산광역시 사상구 가야대로378번길 68</div>'],
    [35.1519683164271, 128.83535685847647, '<div class="infowindow">지사중학교<br>부산광역시 강서구 과학산단로306번길 33</div>'],
    [35.13764213714447, 128.98291439797578, '<div class="infowindow">학장중학교<br>부산광역시 사상구 학장동 547-2</div>'],
    [35.2259942691431, 129.01127474600776, '<div class="infowindow">화명중학교<br>부산광역시 북구 금곡대로186번길 13</div>'],
    [35.23844841557264, 129.01469933819754, '<div class="infowindow">화신중학교<br>부산광역시 북구 산성로12번길 22</div>'],
    [35.11818743993576, 128.88862801086347, '<div class="infowindow">녹산중학교<br>부산광역시 강서구 낙동남로 659</div>'],
    [35.177154430836076, 128.95585554010484, '<div class="infowindow">대저중학교<br>부산광역시 강서구 공항로811번가길 46</div>'],
    [35.16985834266441, 128.9930698394796, '<div class="infowindow">신라중학교<br>부산광역시 사상구 백양대로700번길 35-8</div>'],
    [35.10625801213867, 128.84206086540033, '<div class="infowindow">송정중학교<br>부산광역시 강서구 가락대로 230-72</div>'],
    
    [35.0929065563198, 128.99981847545817, '<div class="infowindow">감천중학교<br>부산광역시 사하구 감천로73번길 60</div>'],
    [35.100760331493596, 129.02043262661925, '<div class="infowindow">경남중학교<br>부산광역시 서구 까치고개로229번길 7</div>'],
    [35.05744718830234, 128.968394201403, '<div class="infowindow">다대중학교<br>부산광역시 사하구 다대로554번길 33</div>'],
    [35.05269240535517, 128.9639770462656, '<div class="infowindow">다선중학교<br>부산광역시 사하구 다대낙조2길 36</div>'],
    [35.06384716495179, 128.98407758238358, '<div class="infowindow">다송중학교<br>부산광역시 사하구 다송로 55</div>'],
    [35.10220776972574, 128.98054166580505, '<div class="infowindow">당리중학교<br>부산광역시 사하구 낙동대로356번길 22</div>'],
    [35.06071057058127, 128.9832361504422, '<div class="infowindow">두송중학교<br>부산광역시 사하구 다송로 76</div>'],
    [35.088412267483314, 129.04007362584505, '<div class="infowindow">부산남중학교<br>부산광역시 영도구 절영로73번길 7</div>'],
    [35.11815117315194, 129.0135142499347, '<div class="infowindow">부산대신중학교<br>부산광역시 서구 대신로109번길 10</div>'],
    [35.120258563143395, 129.01443133007945, '<div class="infowindow">부산여자중학교<br>부산광역시 서구 보수대로 282-23</div>'],
    
    [35.08555702169049, 129.04488959296015, '<div class="infowindow">부산영선중학교<br>부산광역시 영도구 영상길 83</div>'],
    [35.11626635284646, 129.01119004457686, '<div class="infowindow">부산중앙여자중학교<br>부산광역시 서구 대신로 59-32</div>'],
    [35.07123991853078, 129.06495568592905, '<div class="infowindow">부산체육중학교<br>부산광역시 영도구 중리북로21번길 5</div>'],
    [35.1022906669085, 128.9825574585962, '<div class="infowindow">사하중학교<br>부산광역시 사하구 낙동대로302번길 35</div>'],
    [35.080521176133324, 129.04567947656952, '<div class="infowindow">신선중학교<br>부산광역시 영도구 복지관길 40</div>'],
    [35.07733339707523, 129.06886299714725, '<div class="infowindow">영도제일중학교<br>부산광역시 영도구 중리로 64</div>'],
    [35.07857770412929, 128.98169996117568, '<div class="infowindow">장림여자중학교<br>부산광역시 사하구 두송로 64</div>'],
    [35.09393296565608, 128.9944765074444, '<div class="infowindow">장평중학교<br>부산광역시 사하구 사하로 134-1</div>'],
    [35.09488649574907, 129.0180051021727, '<div class="infowindow">초장중학교<br>부산광역시 서구 해돋이로 205</div>'],
    [35.073579123682016, 129.06402070775638, '<div class="infowindow">태종대중학교<br>부산광역시 영도구 함지로79번길 9 </div>'],
     
    [35.099614675356186, 128.95901426435114, '<div class="infowindow">하남중학교<br>부산광역시 사하구 하신번영로 206</div>'],
    [35.11106490590356, 128.95990879090215, '<div class="infowindow">하단중학교<br>부산광역시 사하구 하신번영로380번길 88</div>'],
    [35.10945402013241, 128.969516745376, '<div class="infowindow">건국중학교<br>부산광역시 사하구 승학로17번길 76-8</div>'],
    [35.087272410306575, 129.04577679750957, '<div class="infowindow">남도여자중학교<br>부산광역시 영도구 남도여중길 130</div>'],
    [35.08726167095087, 128.9833866855339, '<div class="infowindow">대동중학교<br>부산광역시 사하구 을숙도대로709번길 27</div>'],
    [35.11358203199386, 129.02446761729365, '<div class="infowindow">대신여자중학교<br>부산광역시 서구 보동길 268</div>'],
    [35.108411648534776, 129.03172717139284, '<div class="infowindow">덕원중학교<br>부산광역시 중구 망양로 356</div>'],
    [35.10067023090131, 129.00127309052243, '<div class="infowindow">동주여자중학교<br>부산광역시 사하구 사리로8번길 28</div>'],
    [35.094546892477574, 128.99917158741556, '<div class="infowindow">삼성중학교<br>부산광역시 사하구 감천로43번길 45-2/div>'],
    [35.082866488482274, 129.02242584873565, '<div class="infowindow">송도중학교<br>부산광역시 서구 해양로 15</div>'],
     
    [35.07509538979614, 128.9819379850708, '<div class="infowindow">영남중학교<br>부산광역시 사하구 다대로277번길 100</div>'],
    [35.069660223953704, 129.06965988299126, '<div class="infowindow">해동중학교<br>부산광역시 영도구 절영로490번길 8-22</div>'],
    [35.1678115037979, 129.10537836197685, '<div class="infowindow">광안중학교<br>부산광역시 수영구 연수로310번길 127</div>'],
    [35.244481110469806, 129.21762646209012, '<div class="infowindow">기장중학교<br>부산광역시 기장군 기장읍 읍내로 120</div>'],
    [35.23410585534614, 129.21247039576605, '<div class="infowindow">대청중학교<br>부산광역시 기장군 기장읍 차성서로 3</div>'],
    [35.16581169206651, 129.1744234586573, '<div class="infowindow">동백중학교<br>부산광역시 해운대구 좌동순환로468번가길 97</div>'],
    [35.17565281375218, 129.0978144330787, '<div class="infowindow">망미중학교<br>부산광역시 수영구 망미배산로 102</div>'],
    [35.337877263790084, 129.1621889770552, '<div class="infowindow">모전중학교<br>부산광역시 기장군 정관읍 정관1로 9</div>'],
    [35.23279096329473, 129.14463143528556, '<div class="infowindow">반송여자중학교<br>부산광역시 해운대구 운봉길 113</div>'],
    [35.234859620643746, 129.15203522250334, '<div class="infowindow">반송중학교<br>부산광역시 해운대구 반송로911번길 59</div>'],
     
    [35.20335393552733, 129.11247440912737, '<div class="infowindow">반안중학교<br>부산광역시 해운대구 명장로67번길 40-32</div>'],
    [35.199735062122485, 129.13586581822992, '<div class="infowindow">반여중학교<br>부산광역시 해운대구 재반로256번길 57-12</div>'],
    [35.15775350376922, 129.10917820315132, '<div class="infowindow">부산수영중학교<br>부산광역시 수영구 호암로38</div>'],
    [35.322411785261195, 129.1875833511587, '<div class="infowindow">부산중앙중학교<br>부산광역시 기장군 정관읍 정관덕산길 73</div>'],
    [35.174960967005994, 129.17891552318292, '<div class="infowindow">부흥중학교<br>부산광역시 해운대구 좌동순환로 226</div>'],
    [35.17877543805504, 129.176189108839, '<div class="infowindow">상당중학교<br>부산광역시 해운대구 대천로103번길 48</div>'],
    [35.17531249300199, 129.1237488625401, '<div class="infowindow">센텀중학교<br>부산광역시 해운대구 센텀북대로 32</div>'],
    [35.167977934372225, 129.1820491056012, '<div class="infowindow">신곡중학교<br>부산광역시 해운대구 좌동순환로 316</div>'],
    [35.17049800850575, 129.16745534183497, '<div class="infowindow">신도중학교<br>부산광역시 해운대구 좌동순환로 50</div>'],
    [35.3290983121468, 129.16889835768617, '<div class="infowindow">신정중학교<br>부산광역시 기장군 정관읍 정관3로 44</div>'],
     
    [35.17535041563579, 129.16693937804948, '<div class="infowindow">양운중학교<br>부산광역시 해운대구 좌동순환로99번길 7</div>'],
    [35.20364794980438, 129.12576341265873, '<div class="infowindow">인지중학교<br>부산광역시 해운대구 반여로 142</div>'],
    [35.26659337137964, 129.22070587744338, '<div class="infowindow">일광중학교<br>부산광역시 기장군 일광면 해빛3로 99</div>'],
    [35.19869335278822, 129.11771691448828, '<div class="infowindow">장산중학교<br>부산광역시 해운대구 선수촌로 47</div>'],
    [35.18985487396234, 129.1311545355074, '<div class="infowindow">재송여자중학교<br>부산광역시 해운대구 재반로84번길 148</div>'],
    [35.19324372184558, 129.1283648705099, '<div class="infowindow">재송중학교<br>부산광역시 해운대구 재반로165번길 16</div>'],
    [35.32357167302646, 129.1732171306766, '<div class="infowindow">정관중학교<br>부산광역시 기장군 정관읍 정관로 531</div>'],
    [35.15727637102979, 129.1182094992277, '<div class="infowindow">한바다중학교<br>부산광역시 수영구 광안로21번가길 57</div>'],
    [35.16394774032928, 129.13588964238411, '<div class="infowindow">해강중학교<br>부산광역시 해운대구 해운대해변로 17</div>'],
    [35.1645861115223, 129.1045385187754, '<div class="infowindow">동수영중학교<br>부산광역시 수영구 광서로 74</div>'],
     
    [35.156816403613156, 129.10718879734418, '<div class="infowindow">동아중학교<br>부산광역시 수영구 호암로 55</div>'],
    [35.315239559213055, 129.24083966916206, '<div class="infowindow">장안중학교<br>부산광역시 기장군 장안읍 좌천2길 43</div>'],
    [35.168282317875, 129.15357133849923, '<div class="infowindow">해운대여자중학교<br>부산광역시 해운대구 우동1로85번길 25</div>'],
    [35.17214550095159, 129.16162732904533, '<div class="infowindow">해운대중학교<br>부산광역시 해운대구 우동2로30번길 99</div>'],





    //고등학교
    [35.164264187128616, 129.15417078467684, '<div class="infowindow">   부산기계공업고등학교<br>부산광역시 해운대구 해운대로 569 (우동)</div>'],
    [35.23233149435929, 129.0954738043307, '<div class="infowindow">   부산대학교사범대학부설고등학교<br>부산광역시 금정구 기찰로22번길 30 (부곡동)</div>'],
    [35.07398861382095, 129.077774041462, '<div class="infowindow">   부산해사고등학교<br>부산광역시 영도구 해양로 425 (동삼동)</div>'],
    [35.166053025443844, 129.02544793925782, '<div class="infowindow">  한국과학영재학교<br>부산광역시 부산진구 백양관문로 105-47 (당감동</div>'],
    [35.1609523079226, 129.02507833360445, '<div class="infowindow">  개금고등학교<br>부산광역시 부산진구 백양대로208번길 71 (개금동</div>'],
    [35.16941323954739, 129.0297751006837, '<div class="infowindow">    개성고등학교<br>부산광역시 부산진구 당감서로 137 (당감동</div>'],
    [35.12051420752649, 129.02029327304766, '<div class="infowindow">  경남고등학교<br>부산광역시 서구 망양로111번길 65 (동대신동3가</div>'],
    [35.15300025616758, 129.06399749972206, '<div class="infowindow">   경남공업고등학교<br>부산광역시 부산진구 전포대로175번길 22 (전포동</div>'],
    [35.13188155767432, 129.04449754508096, '<div class="infowindow">    경남여자고등학교<br>부산광역시 동구 수정중로 29 (수정동</div>'],
    [35.1386069997758, 128.99145994669817, '<div class="infowindow">    구덕고등학교<br>부산광역시 사상구 학감대로 81 (학장동</div>'],

    [35.244562063872834, 129.01209736209026, '<div class="infowindow">	금곡고등학교<br>부산광역시 북구 화명신도시로 236 (금곡동)</div>'],
    [35.24452790951181, 129.02444690171694, '<div class="infowindow">	금명여자고등학교<br>부산광역시 북구 양달로 101 (화명동)</div>'],
    [35.20748200535299, 129.10726483293652, '<div class="infowindow">	금정고등학교<br>부산광역시 동래구 명장로63번길 60-14 </div>'],
    [35.22014595484723, 129.10077302029572, '<div class="infowindow">	금정여자고등학교<br>부산광역시 금정구 서부로76번길 21 (서동)</div>'],
    [35.23972362675974, 129.20952702532074, '<div class="infowindow">	기장고등학교<br>부산광역시 기장군 기장읍 차성서로 77 </div>'],
    [35.21729519636242, 129.0101291550763, '<div class="infowindow">	낙동고등학교<br>부산광역시 북구 의성로47번길 23 (덕천동)</div>'],
    [35.26777755087096, 129.08572308096035, '<div class="infowindow">	남산고등학교<br>부산광역시 금정구 남산로 66 (남산동)</div>'],
    [35.220974167196474, 129.0929851724015, '<div class="infowindow">	내성고등학교<br>부산광역시 금정구 서동로31번길 11 (부곡동)</div>'],
    [35.05274936318126, 128.96965235588118, '<div class="infowindow">	다대고등학교<br>부산광역시 사하구 다대낙조2길 199 (다대동)</div>'],
    [35.0511326844286, 128.82899480654473, '<div class="infowindow">	덕문고등학교<br>부산광역시 강서구 동선길 172 (성북동)</div>'],

    [35.200963956256274, 129.09191123404014, '<div class="infowindow">	동래고등학교<br>부산광역시 동래구 충렬대로285번길 22 (칠산동)</div>'],
    [35.214768103632316, 129.07504571830611, '<div class="infowindow">	동래원예고등학교<br>부산광역시 동래구 금강로 43 (온천동)</div>'],
    [35.201786496973156, 129.03463514654032, '<div class="infowindow">	만덕고등학교<br>부산광역시 북구 함박봉로140번길 98-12</div>'],
    [35.08046447487054, 128.89992004255228, '<div class="infowindow">	명호고등학교<br>부산광역시 강서구 명지오션시티2로 97 (명지동)</div>'],
    [35.14523773877688, 129.07416448580386, '<div class="infowindow">	문현여자고등학교<br>부산광역시 남구 고동골로 86-41 (문현동)</div>'],
    [35.20299415653513, 129.1265353878882, '<div class="infowindow">	반여고등학교<br>부산광역시 해운대구 반여로 136 (반여동)</div>'],
    [35.11483486058673, 129.01308880498004, '<div class="infowindow">	부경고등학교<br>부산광역시 서구 망양로33번길 12 (서대신동3가)</div>'],
    [35.21603090986924, 128.9827454282401, '<div class="infowindow">	부산강서고등학교<br>부산광역시 강서구 공항로1309번길 96-7 (대저1동)</div>'],
    [35.12120545556065, 129.03679718093682, '<div class="infowindow">	부산고등학교<br>부산광역시 동구 초량로40번길 23 (초량동)</div>'],
    [35.13071237679227, 129.08796128265803, '<div class="infowindow">	부산공업고등학교<br>부산광역시 남구 수영로196번길 80 (대연동)</div>'],

    [35.26377366100623, 129.08250500072762, '<div class="infowindow">	부산과학고등학교<br>부산광역시 금정구 금샘로 455-1 (구서동)</div>'],
    [35.167615786796084, 129.02332211901282, '<div class="infowindow">	부산국제고등학교<br>부산광역시 부산진구 백양관문로 105-70 </div>'],
    [35.06996170219297, 129.06497926499753, '<div class="infowindow">	부산남고등학교<br>부산광역시 영도구 중리북로 5 (동삼동)</div>'],
    [35.17816248057307, 129.10136209764042, '<div class="infowindow">	부산남일고등학교<br>부산광역시 수영구 망미배산로48번길 85-23 (망미동)</div>'],
    [35.146221432523475, 129.10534479080798, '<div class="infowindow">	부산동여자고등학교<br>부산광역시 수영구 남천서로32번길 39 (남천동)</div>'],
    [35.19701217768964, 128.99840424483315, '<div class="infowindow">	부산백양고등학교<br>부산광역시 북구 백양대로1016번길 64 (구포동)</div>'],
    [35.113485630472546, 129.02185052896837, '<div class="infowindow">	부산서여자고등학교<br>부산광역시 서구 보수대로 202-6 (동대신동2가)</div>'],
    [35.188756237253216, 128.90345812037182, '<div class="infowindow">	부산소프트웨어마이스터고등학교<br>부산광역시 강서구 가락대로 1393 (봉림동)</div>'],
    [35.11291613032843, 128.96725571600032, '<div class="infowindow">	부산여자고등학교<br>부산광역시 사하구 낙동대로520번길 36 </div>'],
    [35.08469694070737, 129.04538622055617, '<div class="infowindow">	부산영상예술고등학교<br>부산광역시 영도구 영상길 100 </div>'],

    [35.11666507501147, 128.98907538255216, '<div class="infowindow">	부산일과학고등학교<br>부산광역시 사하구 제석로 242 (당리동)</div>'],
    [35.07580528085914, 128.96395638562382, '<div class="infowindow">	부산자동차고등학교<br>부산광역시 사하구 하신중앙로3번나길 16 </div>'],
    [35.31876244161972, 129.23669267798883, '<div class="infowindow">	부산장안고등학교<br>부산광역시 기장군 장안읍 장안고길 8-16 (장안읍)</div>'],
    [35.21517503487507, 129.07382590866962, '<div class="infowindow">	부산전자공업고등학교<br>부산광역시 동래구 금강로59번길 51 (온천동)</div>'],
    [35.1384087937827, 129.07835510451966, '<div class="infowindow">	부산중앙고등학교<br>부산광역시 남구 진남로127번길 50 (대연동)</div>'],
    [35.207679885806186, 129.0794168705271, '<div class="infowindow">	부산중앙여자고등학교<br>부산광역시 동래구 온천천로 131 (명륜동)</div>'],
    [35.179462695123796, 129.05542642251137, '<div class="infowindow">	부산진고등학교<br>부산광역시 부산진구 성지로94번길 54 (초읍동)</div>'],
    [35.1701082767722, 129.07286452472368, '<div class="infowindow">	부산진여자상업고등학교<br>부산광역시 부산진구 진남로 524 (양정동)</div>'],
    [35.071307012590296, 129.06581424477835, '<div class="infowindow">	부산체육고등학교<br>부산광역시 영도구 중리북로21번길 5 </div>'],
    [35.17387762154327, 129.1798240043216, '<div class="infowindow">	부흥고등학교<br>부산광역시 해운대구 좌동순환로 248 (좌동)</div>'],

    [35.12998346990145, 129.11515474005208, '<div class="infowindow">	분포고등학교<br>부산광역시 남구 분포로 57 (용호동)</div>'],
    [35.16872444509033, 128.98548863748573, '<div class="infowindow">	사상고등학교<br>부산광역시 사상구 강선로 24 (덕포동)</div>'],
    [35.20358371003165, 129.05628148556184, '<div class="infowindow">	사직고등학교<br>부산광역시 동래구 쇠미로119번길 51 (사직동)</div>'],
    [35.17211666447504, 128.99227006916237, '<div class="infowindow">	서부산공업고등학교<br>부산광역시 사상구 백양대로768번길 115 (덕포동)</div>'],
    [35.17697031261568, 129.127383542776077, '<div class="infowindow">	센텀고등학교<br>부산광역시 해운대구 해운대로 246 (재송동)</div>'],
    [35.171693241883524, 129.16760045431755, '<div class="infowindow">	신도고등학교<br>부산광역시 해운대구 좌동순환로 64 (좌동)</div>'],
    [35.32815765563965, 129.16663376978718, '<div class="infowindow">	신정고등학교<br>부산광역시 기장군 정관읍 정관3로 14 </div>'],
    [35.177572885446466, 129.17065803654032, '<div class="infowindow">	양운고등학교<br>부산광역시 해운대구 양운로 176 (좌동)</div>'],
    [35.17764082770707, 129.09188005551206, '<div class="infowindow">	연제고등학교<br>부산광역시 연제구 쌍미천로30번길 31 (연산동)</div>'],
    [35.07344958141365, 129.0662081199166, '<div class="infowindow">	영도여자고등학교<br>부산광역시 영도구 중리북로21번길 42 (동삼동)</div>'],

    [35.32245648277042, 129.17064758343574, '<div class="infowindow">	정관고등학교<br>부산광역시 기장군 정관읍 정관로 534 (정관읍)</div>'],
    [35.145357749360706, 129.01372855926783, '<div class="infowindow">	주례여자고등학교<br>부산광역시 사상구 가야대로366번길 146 (주례동)</div>'],
    [35.20265534228108, 129.10929232310508, '<div class="infowindow">	충렬고등학교<br>부산광역시 동래구 명장로106번길 26 (명장동)</div>'],
    [35.120224762466634, 129.11699269124975, '<div class="infowindow">	한국조형예술고등학교<br>부산광역시 남구 동명로169번길 38 (용호동)</div>'],
    [35.16444599514151, 129.13707881963225, '<div class="infowindow">	해강고등학교<br>부산광역시 해운대구 해운대해변로 33 (우동)</div>'],
    [35.167238671689, 129.14514241151844, '<div class="infowindow">	해운대공업고등학교<br>부산광역시 해운대구 해운대로469번길 96 (우동)</div>'],
    [35.239583916323376, 129.01084664873883, '<div class="infowindow">	화명고등학교<br>부산광역시 북구 화명신도시로 169 (화명동)</div>'],
    [35.14641062145324, 129.03147916927952, '<div class="infowindow">	가야고등학교<br>부산광역시 부산진구 엄광로 152 (가야동)</div>'],
    [35.110762173959, 128.96956367406594, '<div class="infowindow">	건국고등학교<br>부산광역시 사하구 하단2동 승학로17번길 76-8</div>'],
    [35.11606267161423, 129.0124383042172, '<div class="infowindow">	경성전자고등학교<br>부산광역시 서구 꽃마을로 25 (서대신동3가)</div>'],

    [35.16363564269214, 129.03182719614568, '<div class="infowindow">	경원고등학교<br>부산광역시 부산진구 백양관문로 40 (당감동)</div>'],
    [35.112139655009706, 128.9217863155579, '<div class="infowindow">	경일고등학교<br>부산광역시 강서구 영강길 153-42 (명지동)</div>'],
    [35.2043892118095, 129.01201809465041, '<div class="infowindow">	경혜여자고등학교<br>부산광역시 북구 시랑로21번길 138 (구포동)</div>'],
    [35.18270382420838, 129.06743279692503, '<div class="infowindow">	계성여자고등학교<br>부산광역시 연제구 해맞이로109번길 47 (거제동)</div>'],
    [35.08333421819982, 129.06445656201535, '<div class="infowindow">	광명고등학교<br>부산광역시 영도구 와치로 131 (동삼동)</div>'],
    [35.13494611093476, 129.05166888593703, '<div class="infowindow">	금성고등학교<br>부산광역시 동구 증산로 83 (좌천동)</div>'],
    [35.221244147528935, 129.1081061369769, '<div class="infowindow">	금정전자고등학교<br>부산광역시 금정구 서금로 75 (서동)</div>'],
    [35.105236799358856, 129.033900488903, '<div class="infowindow">	남성여자고등학교<br>부산광역시 중구 샘길 14 (대청동1가)</div>'],
    [35.101360226616215, 128.97267159044566, '<div class="infowindow">	대광고등학교<br>부산광역시 사하구 동매로 135 (당리동)</div>'],
    [35.179553757261665, 128.99319530068846, '<div class="infowindow">	대덕여자고등학교<br>부산광역시 사상구 백양대로804번길 42-55 (덕포동)</div>'],

    [35.0867525303242, 128.98250616422663, '<div class="infowindow">	대동고등학교<br>부산광역시 사하구 을숙도대로709번길 27 (신평동)</div>'],
    [35.212111594558436, 129.09628232048695, '<div class="infowindow">	대명여자고등학교<br>부산광역시 동래구 시실로 135 (명장동)</div>'],
    [35.13315494802751, 129.07366900061865, '<div class="infowindow">	대양고등학교<br>부산광역시 남구 지게골로 128-27 (문현동)</div>'],
    [35.12903804786286, 129.1014244530877, '<div class="infowindow">	대연고등학교<br>부산광역시 남구 조각공원로 20 (대연동)</div>'],
    [35.24112093763663, 129.08132872065158, '<div class="infowindow">	대진전자통신고등학교<br>부산광역시 금정구 수림로 92 (장전동)</div>'],
    [35.16695733739197, 129.1041536263169, '<div class="infowindow">	덕문여자고등학교<br>부산광역시 수영구 연수로310번길 114 (광안동)</div>'],
    [35.13744594562512, 129.05580623057918, '<div class="infowindow">	데레사여자고등학교<br>부산광역시 동구 정공단로47번길 14 (범일동)</div>'],
    [35.24633357470101, 129.0963456805052, '<div class="infowindow">	동래여자고등학교<br>부산광역시 금정구 체육공원로 20</div>' ],
    [35.1218612448098, 129.10122146203307, '<div class="infowindow">	동명공업고등학교<br>부산광역시 남구 신선로 410 (용당동)</div>'],
    [35.093498826327156, 128.98653745604508, '<div class="infowindow">	동아고등학교<br>부산광역시 사하구 괴정로244번길 63 (괴정동)</div>'],

    [35.09256302775862, 128.9887119158287, '<div class="infowindow">	동아공업고등학교<br>부산광역시 사하구 괴정로260번길 79 (괴정동)</div>'],
    [35.165950103331376, 129.07157119993295, '<div class="infowindow">	동의공업고등학교<br>부산광역시 부산진구 양지로 50 (전포동)</div>'],
    [35.197573098153285, 129.0502734624445, '<div class="infowindow">	동인고등학교<br>부산광역시 동래구 쇠미로31번길 34 (사직동)</div>'],
    [35.100937005022324, 129.03137760490944, '<div class="infowindow">	동주여자고등학교<br>부산광역시 중구 광복중앙로 18 (광복동3가)</div>'],
    [35.14531208911689, 129.08713653135823, '<div class="infowindow">	동천고등학교<br>부산광역시 남구 못골번영로 105 </div>'],
    [35.132523539170435, 129.06737883135244, '<div class="infowindow">	배정고등학교<br>부산광역시 남구 장고개로85번길 14-16 (문현동)</div>'],
    [35.13214135243238, 129.0673892680944, '<div class="infowindow">	배정미래고등학교<br>부산광역시 남구 장고개로85번길 14-40 </div>'],
    [35.082527720583286, 129.0222341232474, '<div class="infowindow">	부산관광고등학교<br>부산광역시 서구 천마로 52 (남부민동)</div>'],
    [35.177611625741406, 128.95627421496457, '<div class="infowindow">	부산대저고등학교<br>부산광역시 강서구 공항로811번가길 46 (대저2동)</div>'],
    [35.152850249785445, 129.070963336316, '<div class="infowindow">	부산동고등학교<br>부산광역시 부산진구 동성로30번길 36 (전포동)</div>'],

    [35.15285805260976, 129.0710019805187, '<div class="infowindow">	부산동성고등학교<br>부산광역시 부산진구 동성로 16 (전포동)</div>'],
    [35.10909466494601, 129.03233698067635, '<div class="infowindow">	부산디지털고등학교<br>부산광역시 중구 망양로 356 (영주동)</div>'],
    [35.151260771742784, 129.07050874931213, '<div class="infowindow">	부산마케팅고등학교<br>부산광역시 부산진구 봉수로 13 (전포동)</div>'],
    [35.165860936511905, 129.14362966399733, '<div class="infowindow">	부산문화여자고등학교<br>부산광역시 해운대구 해운대로469번길 50 (우동)</div>'],
    [35.08131286987695, 129.04212970912076, '<div class="infowindow">  부산보건고등학교<br>부산광역시 영도구 절영로 163 (영선동4가)</div>'],
    [35.13934518388574, 129.08547861787883, '<div class="infowindow">	부산세무고등학교<br>부산광역시 남구 진남로 82-19 (대연동)</div>'],
    [35.16593800199611, 129.14432443600796, '<div class="infowindow">	부산센텀여자고등학교<br>부산광역시 해운대구 해운대로469번길 50-1 (우동)</div>'],
    [35.169619423924196, 129.0962151873962, '<div class="infowindow">	부산여자상업고등학교<br>부산광역시 수영구 금련로 43 (망미동)</div>'],
    [35.24412873149497, 129.09594915595082, '<div class="infowindow">	부산예술고등학교<br>부산광역시 금정구 체육공원로 20 </div>'],
    [35.18334422910412, 129.09769174753635, '<div class="infowindow">	부산외국어고등학교<br>부산광역시 연제구 고분로 144 </div>'],

    [35.17746846500243, 129.0644821545179, '<div class="infowindow">	부산정보고등학교<br>부산광역시 부산진구 화지로 24 (양정동)</div>'],
    [35.22377307146231, 129.09244068792063, '<div class="infowindow">	부산정보관광고등학교<br>부산광역시 금정구 동현로 37 (부곡동)</div>'],
    [35.170056101246516, 129.07280699964488, '<div class="infowindow">	부산진여자고등학교<br>부산광역시 부산진구 양정로 48 (양정동)</div>'],
    [35.121299010911336, 129.03337842697516, '<div class="infowindow">	부산컴퓨터과학고등학교<br>부산광역시 동구 초량로80번길 5 (초량동)</div>'],
    [35.09110466038065, 129.0022861146751, '<div class="infowindow">	부일외국어고등학교<br>부산광역시 사하구 감천로73번길 36 </div>'],
    [35.091452184345094, 129.00198331525178, '<div class="infowindow">	부일전자디자인고등학교<br>부산광역시 사하구 감천로73번길 36 (감천동)</div>'],
    [35.25546572945411, 129.10414375113902, '<div class="infowindow">	브니엘고등학교<br>부산광역시 금정구 체육공원로 154 (구서동)</div>'],
    [35.255148789520454, 129.10269458276244, '<div class="infowindow">	브니엘여자고등학교<br>부산광역시 금정구 체육공원로 154 </div>'],
    [35.25450870369239, 129.10346288047046, '<div class="infowindow">	브니엘예술고등학교<br>부산광역시 금정구 체육공원로 154 (구서동)</div>'],
    [35.19665635517423, 129.05217338191719, '<div class="infowindow">	사직여자고등학교<br>부산광역시 동래구 쇠미로27번길 21 (사직동)</div>'],

    [35.094134951465065, 128.99753267656635, '<div class="infowindow">	삼성여자고등학교<br>부산광역시 사하구 감천로43번길 45 (감천동)</div>'],
    [35.1937378267374, 129.01023063492372, '<div class="infowindow">	삼정고등학교<br>부산광역시 북구 시랑로118번길 53 (구포동)</div>'],
    [35.19396403024176, 129.00650641603815, '<div class="infowindow">	성도고등학교<br>부산광역시 북구 시랑로132번길 87 </div>'],
    [35.16715416241329, 129.07203339499443, '<div class="infowindow">	성모여자고등학교<br>부산광역시 부산진구 양지로 29-1 (양정동)</div>'],
    [35.089326524968754, 128.97937639865685, '<div class="infowindow">	성일여자고등학교<br>부산광역시 사하구 다대로 161 </div>'],
    [35.12766689851383, 129.08087983109002, '<div class="infowindow">	성지고등학교<br>부산광역시 남구 유엔로 39 (우암동)</div>'],
    [35.1702598660298, 129.07867026551386, '<div class="infowindow">	세정고등학교<br>부산광역시 부산진구 양정로 88-12 </div>'],
    [35.169717481861056, 129.07408134124566, '<div class="infowindow">	양정고등학교<br>부산광역시 부산진구 양정로 46 (양정동)</div>'],
    [35.225754785555, 129.15600003494092, '<div class="infowindow">	영산고등학교<br>부산광역시 해운대구 반송순환로 142-1 (반송동)</div>'],
    [35.11555790571431, 129.1070093793025, '<div class="infowindow">	예문여자고등학교<br>부산광역시 남구 동명로92번길 76 (용호동)</div>'],

    [35.21455896929898, 129.0949560069633, '<div class="infowindow">	용인고등학교<br>부산광역시 동래구 시실로107번길 37 (명장동)</div>'],
    [35.19417257445584, 129.07763215026287, '<div class="infowindow">	이사벨고등학교<br>부산광역시 연제구 중앙대로 1197 (거제동)</div>'],
    [35.31483165801194, 129.24029929030212, '<div class="infowindow">	장안제일고등학교<br>부산광역시 기장군 장안읍 좌천2길 43 </div>'],
    [35.24364016046777, 129.09846114475107, '<div class="infowindow">	지산고등학교<br>부산광역시 금정구 오륜대로 50 (부곡동)</div>'],
    [35.206160258742585, 129.09632070070077, '<div class="infowindow">	학산여자고등학교<br>부산광역시 동래구 충렬사로51번길 62</div>'],
    [35.1464711859556, 129.07114838640447, '<div class="infowindow">	한얼고등학교<br>부산광역시 남구 고동골로69번가길 54 (문현동)</div>'],
    [35.093197344911516, 128.99012427366438, '<div class="infowindow">	해동고등학교<br>부산광역시 사하구 사하로141번나길 11-15 </div>'],
    [35.17152928017009, 129.16243416914594, '<div class="infowindow">	해운대고등학교<br>부산광역시 해운대구 우동3로11번길 43 (우동)</div>'],
    [35.169882405698395, 129.15745541132623, '<div class="infowindow">	해운대관광고등학교<br>부산광역시 해운대구 우동2로60번길 38 (우동)</div>'],
    [35.1701435864992, 129.15330487586442, '<div class="infowindow">	해운대여자고등학교<br>부산광역시 해운대구 우동1로85번길 71 (우동)</div>'],

    [35.10923928466544, 129.02509484448046, '<div class="infowindow">	혜광고등학교<br>부산광역시 중구 망양로259번길 5 </div>'],
    [35.20316603870111, 129.11138918233388, '<div class="infowindow">	혜화여자고등학교<br>부산광역시 동래구 명장로 99 </div>'],
    [35.17400517969901, 128.99044734569677, '<div class="infowindow">	부산산업학교<br>부산광역시 사상구 백양대로768번길 64 (덕포동)</div>'],
    



    //초등학교
    [35.15412103538409, 129.04435487735827, '<div class="infowindow">가남초등학교<br>	부산광역시 부산진구 엄광로 325 (가야동)</div>'],
    [35.14620392175892, 129.03557394666748, '<div class="infowindow">가산초등학교<br>	부산광역시 부산진구 엄광로182번길 49 (가야동)</div>'],
    [35.153441186671024, 129.0356463466708, '<div class="infowindow">가야초등학교<br>	부산광역시 부산진구 대학로 22 (가야동)</div>'],
    [35.14874886705568, 129.02503406201208, '<div class="infowindow">가평초등학교<br>	부산광역시 부산진구 가야대로482번길 87 (가야동)</div>'],
    [35.154419986667186, 129.01963891598413, '<div class="infowindow">개금초등학교<br>	부산광역시 부산진구 가야대로443번길 25-10 (개금동)</div>'],
    [35.15611873882252, 129.01593474667214, '<div class="infowindow"개림초등학교<br>	부산광역시 부산진구 백양대로320번길 40 (개금동)</div>'],
    [35.16450541991335, 129.02819374667604, '<div class="infowindow">개원초등학교<br>	부산광역시 부산진구 백양관문로77번길 17</div>'],
    [35.15859830073806, 129.02651984667315, '<div class="infowindow">개포초등학교<br>	부산광역시 부산진구 백양대로208번길 9 (개금동)</div>'],
    [35.15852717260967, 129.0206842313296, '<div class="infowindow">개화초등학교<br>	부산광역시 부산진구 개금본동로66번길 12-12 (개금동)</div>'],
    [35.16423203622613, 129.04078654667586, '<div class="infowindow">당감초등학교<br>	부산광역시 부산진구 당감로 22-5 (당감동)</div>'],
    
    [35.161504217335846, 129.03479027736168, '<div class="infowindow">당평초등학교<br>	부산광역시 부산진구 백양대로136번길 26 (당감동)</div>'],
    [35.14888729796454, 129.09735267332712, '<div class="infowindow">대남초등학교<br>	부산광역시 남구 황령대로 343번길 9-55 (대연동)</div>'],
    [35.13728118673433, 129.09211251597617, '<div class="infowindow">대연초등학교<br>	부산광역시 남구 진남로18번길 11 (대연동)</div>'],
    [35.128994591113994, 129.1001594351738, '<div class="infowindow">대천초등학교<br>	부산광역시 남구 조각공원로 19 (대연동)</div>'],
    [35.176339674153525, 129.03094815803777, '<div class="infowindow">동양초등학교<br>	부산광역시 부산진구 백양산로 99 (부암동)</div>'],
    [35.17290585955833, 129.03090412718845, '<div class="infowindow">동원초등학교<br>	부산광역시 부산진구 백양산로 43 (당감동)</div>'],
    [35.12503080961477, 129.03739003535992, '<div class="infowindow">동일중앙초등학교<br>	부산광역시 동구 구봉로 46 (수정동)</div>'],
    [35.12123751705162, 129.08372032821575, '<div class="infowindow">동천초등학교<br>	부산광역시 남구 석포로26번길 22</div>'],
    [35.16738556875388, 129.0349132699596, '<div class="infowindow">동평초등학교<br>	부산광역시 부산진구 당감서로65번길 31</div>'],
       
    [35.114035224818146, 129.0828433340708, '<div class="infowindow">동항초등학교<br>	부산광역시 남구 우암로 42 (감만동)</div>'],
    [35.14513237918831, 129.07269789728804, '<div class="infowindow">문현초등학교<br>	부산광역시 남구 고동골로 86-13 (문현동)</div>'],
    [35.11844445734489, 129.10565369057863, '<div class="infowindow">백운초등학교<br>	부산광역시 남구 동명로 76 (용호동)</div>'],
    [35.139148037551784, 129.05006384987195, '<div class="infowindow">범일초등학교<br>	부산광역시 동구 증산서로 55 (범일동)</div>'],
    [35.14996337370892, 129.05606729984456, '<div class="infowindow">부산진초등학교<br>	부산광역시 부산진구 범천로 30 (범천동)</div>'],
    [35.16504311204536, 129.04893611037377, '<div class="infowindow">부암초등학교<br>	부산광역시 부산진구 신천대로263번길 26 (부암동)</div>'],
    [35.15501660218924, 129.05321796321, '<div class="infowindow">부전초등학교<br>	부산광역시 부산진구 부전로65번길 25</div>'],
    [35.12884124194062, 129.11411519292562, '<div class="infowindow">분포초등학교<br>	부산광역시 남구 분포로 41 (용호동)</div>'],
    [35.12661640779414, 129.09179065408907, '<div class="infowindow">석포초등학교<br>	부산광역시 남구 석포로86번길 76 (대연동)</div>'],
    [35.1487789227082, 129.04903092765872, '<div class="infowindow">선암초등학교<br>	부산광역시 부산진구 엄광로 412 (범천동)</div>'],
       
    [35.13489983614425, 129.058264438183, '<div class="infowindow">성남초등학교<br>	부산광역시 동구 범일로53번길 14 (범일동)</div>'],
    [35.143513349833, 129.06917115525889, '<div class="infowindow">성동초등학교<br>	부산광역시 남구 전포대로68번길 27</div>'],
    [35.15151815122998, 129.06772905660304, '<div class="infowindow">성북초등학교<br>	부산광역시 부산진구 황령대로 79 (전포동)</div>'],
    [35.14521148931271, 129.06192647290175, '<div class="infowindow">성서초등학교<br>	부산광역시 부산진구 중앙번영로 25 (범천동)</div>'],
    [35.16369161816576, 129.0664527045206, '<div class="infowindow">성전초등학교<br>	부산광역시 부산진구 전포대로298번길 15 (전포동)</div>'],
    [35.16442544620553, 129.05698373545863, '<div class="infowindow">성지초등학교<br>	부산광역시 부산진구 시민공원로 62 (범전동)</div>'],
    [35.131014046725085, 129.07220766166216, '<div class="infowindow">성천초등학교<br>	부산광역시 남구 장고개로 64-41 (우암동)</div>'],
    [35.134301637267754, 129.04274692706807, '<div class="infowindow">수성초등학교<br>	부산광역시 동구 망양로 807</div>'],
    [35.13151600660494, 129.0462783463831, '<div class="infowindow">수정초등학교<br>	부산광역시 동구 진성로 29 (수정동)</div>'],
    [35.12932610450965, 129.07799457055262, '<div class="infowindow">신연초등학교<br>	부산광역시 남구 유엔로25번길 66 (우암동)</div>'],
       
    [35.1713566531616, 129.08104571999, '<div class="infowindow">양동초등학교<br>	부산광역시 부산진구 황령산로605번길 35-10 (양정동)</div>'],
    [35.17046833887687, 129.06586788701415, '<div class="infowindow">양성초등학교<br>	부산광역시 부산진구 양성로 34 (양정동)</div>'],
    [35.17522589381625, 129.07109308769049, '<div class="infowindow">양정초등학교<br>	부산광역시 부산진구 중앙대로941번길 24 (양정동)</div>'],
    [35.17219012064577, 129.05229710635518, '<div class="infowindow">연지초등학교<br>	부산광역시 부산진구 연지로 29</div>'],
    [35.13951691960794, 129.0812522912417, '<div class="infowindow">연포초등학교<br>	부산광역시 남구 진남로 120-5</div>'],
    [35.1769250921547, 129.04659659661257, '<div class="infowindow">연학초등학교<br>	부산광역시 부산진구 초읍천로43번길 10</div>'],
    [35.10408977939601, 129.116720618406, '<div class="infowindow">오륙도초등학교<br>	부산광역시 남구 오륙도로 57</div>'],
    [35.116811923593424, 129.09428660656022, '<div class="infowindow">용당초등학교<br>	부산광역시 남구 신선로 341 (용당동)</div>'],
    [35.13078729630629, 129.10823225072616, '<div class="infowindow">용문초등학교<br>	부산광역시 남구 신선로 542 (용호동)</div>'],
    [35.116352670998346, 129.11591110978722, '<div class="infowindow">용산초등학교<br>	부산광역시 남구 동명로 176번길 55 (용호동)</div>'],
       
    [35.142762502066724, 129.09940887943495, '<div class="infowindow">용소초등학교<br>	부산광역시 남구 수영로325번길 114 (대연동)</div>'],
    [35.122682048928965, 129.10894123841146, '<div class="infowindow">용호초등학교<br>	부산광역시 남구 용호로42번길 94 (용호동)</div>'],
    [35.12553595475713, 129.0760228514749, '<div class="infowindow">우암초등학교<br>	부산광역시 남구 우암로 190-19 (우암동)</div>'],
    [35.11026468528573, 129.11509516626, '<div class="infowindow">운산초등학교<br>	부산광역시 남구 용호로269번길 89 (용호동)</div>'],
    [35.15947965274071, 129.0635228023614, '<div class="infowindow">전포초등학교<br>	부산광역시 부산진구 전포대로255번길 38 (전포동)</div>'],
    [35.14579841454406, 129.0194687371365, '<div class="infowindow">주례초등학교<br>	부산광역시 부산진구 진사로61번길 28-7 (개금동)</div>'],
    [35.147109815430426, 129.02064350844984, '<div class="infowindow">주원초등학교<br>	부산광역시 부산진구 복지로 71</div>'],
    [35.11612330505874, 129.03619145954036, '<div class="infowindow">초량초등학교<br>	부산광역시 동구 초량상로 49 (초량동)</div>'],
    [35.18044831430474, 129.05407367319512, '<div class="infowindow">초읍초등학교<br>	부산광역시 부산진구 성지로104번가길 26</div>'],
    [35.15250443369581, 129.06866332350273, '<div class="infowindow">동성초등학교<br>	부산광역시 부산진구 동성로 26 (전포동)</div>'],
       
    [35.19449343380326, 129.075454595183, '<div class="infowindow">부산교육대학교부설초등학교<br>	부산광역시 연제구 교대로 24 (거제동)</div>'],
    [35.17805755490486, 129.0668756609222, '<div class="infowindow">거제초등학교<br>	부산광역시 연제구 해맞이로 39 (거제동)</div>'],
    [35.19727586647486, 129.07681699045358, '<div class="infowindow">거학초등학교<br>	부산광역시 연제구 교대로24번길 36</div>'],
    [35.296203570842664, 129.11110872660495, '<div class="infowindow">공덕초등학교<br>	부산광역시 금정구 대두로 2 (두구동)</div>'],
    [35.18700319128037, 129.11015525858414, '<div class="infowindow">과정초등학교<br>	부산광역시 연제구 과정로164번길 37</div>'],
    [35.215457011951024, 129.09183270530048, '<div class="infowindow">교동초등학교<br>	부산광역시 동래구 시실로 73-13</div>'],
    [35.254009462810316, 129.08709575900443, '<div class="infowindow">구서초등학교<br>	부산광역시 금정구 구서중앙로 35 (구서동)</div>'],
    [35.2028225413577, 129.06458390739053, '<div class="infowindow">금강초등학교<br>	부산광역시 동래구 사직북로28번길 125 (온천동)</div>'],
    [35.227760447850414, 129.08038907617734, '<div class="infowindow">금빛초등학교<br>	부산광역시 금정구 소정로 31 (장전동)</div>'],
    [35.219411278358926, 129.1093657633563, '<div class="infowindow">금사초등학교<br>	부산광역시 금정구 금사로57번길 24 (서동)</div>'],
       
    [35.26881470483151, 129.08381651286837, '<div class="infowindow">금샘초등학교<br>	부산광역시 금정구 금샘로 525 (남산동)</div>'],
    [35.25080016248121, 129.05782552662595, '<div class="infowindow">금성초등학교<br>	부산광역시 금정구 중리1길 15 (금성동)</div>'],
    [35.2412570329623, 129.0921381070605, '<div class="infowindow">금양초등학교<br>	부산광역시 금정구 중앙대로 1755 (부곡동)</div>'],
    [35.22781266057149, 129.08465512897513, '<div class="infowindow">금정초등학교<br>	부산광역시 금정구 식물원로44번길 46 (장전동)</div>'],
    [35.199308260048774, 129.088138846017, '<div class="infowindow">낙민초등학교<br>	부산광역시 동래구 충렬대로272번길 34 (낙민동)</div>'],
    [35.194471139496756, 129.06950061914753, '<div class="infowindow">남문초등학교<br>	부산광역시 연제구 법원북로 23</div>'],
    [35.26261327980606, 129.0889532237439, '<div class="infowindow">남산초등학교<br>	부산광역시 금정구 금강로 614 (남산동)</div>'],
    [35.207123078145486, 129.0763464054601, '<div class="infowindow">내산초등학교<br>	부산광역시 동래구 중앙대로1335번길 38 (온천동)</div>'],
    [35.204639954463616, 129.08953362574994, '<div class="infowindow">내성초등학교<br>	부산광역시 동래구 동래로 173 (복천동)</div>'],
    [35.20296485505601, 129.060206136048, '<div class="infowindow">달북초등학교<br>	부산광역시 동래구 쇠미로 131 (온천동)</div>'],
       
    [35.177896087111144, 129.0910198863885, '<div class="infowindow">동명초등학교<br>	부산광역시 연제구 쌍미천로44번길 17 (연산동)</div>'],
    [35.2114965272472, 129.1074801499488, '<div class="infowindow">동상초등학교<br>	부산광역시 금정구 옥봉로 5 (서동)</div>'],
    [35.22215816243633, 129.0928669309894, '<div class="infowindow">동현초등학교<br>	부산광역시 금정구 동현로 36 (부곡동)</div>'],
    [35.253025768141384, 129.08928422466226, '<div class="infowindow">두실초등학교<br>	부산광역시 금정구 중앙대로1893번길 33 (구서동)</div>'],
    [35.20754397452328, 129.10628196586708, '<div class="infowindow">명동초등학교<br>	부산광역시 동래구 명장로63번길 60-5 (명장동)</div>'],
    [35.20800109333608, 129.0829731580172, '<div class="infowindow">명륜초등학교<br>	부산광역시 동래구 동래로 91 (명륜동)</div>'],
    [35.211751172619365, 129.10104526723717, '<div class="infowindow">명서초등학교<br>	부산광역시 동래구 명서로 121 (명장동)</div>'],
    [35.20817533026517, 129.09659329095703, '<div class="infowindow">명장초등학교<br>	부산광역시 동래구 복천로 121 (명장동)</div>'],
    [35.20366714845159, 129.07276279923082, '<div class="infowindow">미남초등학교<br>	부산광역시 동래구 충렬대로100번길 83 (온천동)</div>'],
    [35.23350239340256, 129.09379518713848, '<div class="infowindow">부곡초등학교<br>	부산광역시 금정구 기찰로22번길 15 (부곡동)</div>'],

    [35.200882033476354, 129.0541975560504, '<div class="infowindow">사직초등학교<br>	부산광역시 동래구 쇠미로81번길 7 (사직동)</div>'],
    [35.22040658089416, 129.1048888863117, '<div class="infowindow">서곡초등학교<br>	부산광역시 금정구 윤산로 279 (서동)</div>'],
    [35.21936124482985, 129.0975609909468, '<div class="infowindow">서동초등학교<br>	부산광역시 금정구 동현로 147 (서동)</div>'],
    [35.215045036146186, 129.09537636787226, '<div class="infowindow">서명초등학교<br>	부산광역시 금정구 명서로 48</div>'],
    [35.20041577906691, 129.080483861787, '<div class="infowindow">수안초등학교<br>	부산광역시 동래구 온천천로 215 (수안동)</div>'],
    [35.19186045413092, 129.10809244922794, '<div class="infowindow">안남초등학교<br>	부산광역시 동래구 연안로 46 (안락동)</div>'],
    [35.20182190938941, 129.1038071012281, '<div class="infowindow">안락초등학교<br>	부산광역시 동래구 명안로53번길 22 (명장동)</div>'],    
    [35.19377244266703, 129.09421038902494, '<div class="infowindow">안민초등학교<br>	부산광역시 동래구 온천천로381번길 19 (낙민동)</div>'],
    [35.19480425152632, 129.09933324958917, '<div class="infowindow">안진초등학교<br>	부산광역시 동래구 안남로 63 (안락동)</div>'],
    [35.19786356686194, 129.0691472667601, '<div class="infowindow">여고초등학교<br>	부산광역시 동래구 여고로63번가길 12 (사직동)</div>'],
       
    [35.18463832137097, 129.08805784892925, '<div class="infowindow">연동초등학교<br>	부산광역시 연제구 고분로56번길 40 (연산동)</div>'],
    [35.170927303698804, 129.0927726860219, '<div class="infowindow">연미초등학교<br>	부산광역시 연제구 금련로38번길 84 (연산동)</div>'],
    [35.178270349168166, 129.08411581629332, '<div class="infowindow">연산초등학교<br>	부산광역시 연제구 월드컵대로 41 (연산동)</div>'],
    [35.190673338629956, 129.08612565982563, '<div class="infowindow">연서초등학교<br>	부산광역시 연제구 거제천로270번길 30 (연산동)</div>'],    
    [35.192401330561566, 129.09323675343376, '<div class="infowindow">연신초등학교<br>	부산광역시 연제구 신금로23번길 30 (연산동)</div>'],
    [35.18471395279567, 129.09598173721287, '<div class="infowindow">연일초등학교<br>	부산광역시 연제구 고분로 126-4 (연산동)</div>'],
    [35.18443101060927, 129.07853676785368, '<div class="infowindow">연제초등학교<br>	부산광역시 연제구 중앙대로1065번길 14 (연산동)</div>'],
    [35.186033475941244, 129.10048130772563, '<div class="infowindow">연천초등학교<br>	부산광역시 연제구 과정로225번길 46 (연산동)</div>'],
    [35.195864288504765, 129.05742239069593, '<div class="infowindow">예원초등학교<br>	부산광역시 동래구 사직로 78 (사직동)</div>'],
    [35.21235023513908, 129.0739351480183, '<div class="infowindow">온천초등학교<br>	부산광역시 동래구 충렬대로107번길 124 (온천동)</div>'],
       
    [35.24803885367652, 129.08540955013345, '<div class="infowindow">장서초등학교<br>	부산광역시 금정구 금강로 453</div>'],
    [35.24119932128689, 129.0826452606947, '<div class="infowindow">장전초등학교<br>	부산광역시 금정구 수림로 90 (장전동)</div>'],
    [35.19241764753815, 129.06559478575883, '<div class="infowindow">창신초등학교<br>	부산광역시 연제구 종합운동장로12번길 15 (거제동)</div>'],
    [35.272653976351535, 129.09177814719473, '<div class="infowindow">청룡초등학교<br>	부산광역시 금정구 팔송로 6 (청룡동)</div>'],
    [35.20047028756217, 129.11175752838648, '<div class="infowindow">충렬초등학교<br>	부산광역시 동래구 안락로125번길 22 (안락동)</div>'],
    [35.18157166432768, 129.112070746031, '<div class="infowindow">토현초등학교<br>	부산광역시 연제구 토현로 48 (연산동)</div>'],
    [35.22693037102735, 129.09675843128505, '<div class="infowindow">현곡초등학교<br>	부산광역시 금정구 동부곡로27번라길 20 (부곡동)</div>'],
    [35.24703099323263, 129.09887046057761, '<div class="infowindow">동래초등학교<br>	부산광역시 금정구 체육공원로44번길 26</div>'],
    [35.272675767867874, 129.09476011090513, '<div class="infowindow">부산삼육초등학교<br>	부산광역시 금정구 금정도서관로 17 (청룡동)</div>'],
    [35.20195135287389, 129.1126455474225, '<div class="infowindow">혜화초등학교<br>	부산광역시 동래구 명장로99번길 25 (명장동)</div>'],
       
    [35.19609339260594, 128.8958111423598, '<div class="infowindow">가락초등학교<br>	부산광역시 강서구 호계로 41 (죽림동)</div>'],
    [35.156188308281415, 128.98842499377687, '<div class="infowindow">감전초등학교<br>	부산광역시 사상구 괘감로 132 (감전동)</div>'],
    [35.160023342380114, 128.98599163132144, '<div class="infowindow">괘법초등학교<br>	부산광역시 사상구 사상로161번길 8 (괘법동)</div>'],
    [35.200108887456885, 128.99348332392324, '<div class="infowindow">구남초등학교<br>	부산광역시 북구 구남로14번가길 23 (구포동)</div>'],
    [35.20317244771019, 129.0008979984561, '<div class="infowindow">구포초등학교<br>	부산광역시 북구 백양대로1124번길 20 (구포동)</div>'],
    [35.137707976250844, 128.99272283933124, '<div class="infowindow">구학초등학교<br>	부산광역시 사상구 학감대로 49 (학장동)</div>'],
    [35.26132694849845, 129.01699314321937, '<div class="infowindow">금곡초등학교<br>	부산광역시 북구 효열로 174</div>'],
    [35.24168987154677, 129.0110607522453, '<div class="infowindow">금명초등학교<br>	부산광역시 북구 화명신도시로 197 (금곡동)</div>'],
    [35.26542390295608, 129.02001301331947, '<div class="infowindow">금창초등학교<br>	부산광역시 북구 효열로235번길 14 (금곡동)</div>'],
    [35.08369534669515, 128.91084851395252, '<div class="infowindow">남명초등학교<br>	부산광역시 강서구 명지오션시티11로 132 (명지동)</div>'],
       
    [35.11524250238408, 128.8859250994214, '<div class="infowindow">녹명초등학교<br>	부산광역시 강서구 낙동남로 617 (녹산동)</div>'],
    [35.15127447570485, 128.83689082296883, '<div class="infowindow">녹산초등학교<br>	부산광역시 강서구 과학산단2로20번길 55</div>'],
    [35.220094130269835, 128.9384897414099, '<div class="infowindow">대사초등학교<br>	부산광역시 강서구 낙동북로 73</div>'],
    [35.21488859127777, 128.97918424181185, '<div class="infowindow"대상초등학교<br>	부산광역시 강서구 대저로 249 (대저1동)</div>'],
    [35.21591190256696, 128.95473285281864, '<div class="infowindow">대저초등학교<br>	부산광역시 강서구 대저로29번길 27</div>'],
    [35.2423471563199, 129.02290028333852, '<div class="infowindow">대천리초등학교<br>	부산광역시 북구 산성로 87-10</div>'],
    [35.175510901872904, 128.95583999570948, '<div class="infowindow">덕두초등학교<br>	부산광역시 강서구 공항로791번길 68 (대저2동)</div>'],
    [35.1749580603632, 128.99052618760305, '<div class="infowindow">덕상초등학교<br>	부산광역시 사상구 덕상로 32 (덕포동)</div>'],
    [35.213165711783454, 129.00796994930033, '<div class="infowindow">덕성초등학교<br>	부산광역시 북구 만덕대로39번길 45</div>'],
    [35.20955052356968, 129.02329649582322, '<div class="infowindow">덕양초등학교<br>	부산광역시 북구 함박봉로 42 (만덕동)</div>'],
       
    [35.20837781284109, 129.00650107969045, '<div class="infowindow">덕천초등학교<br>	부산광역시 북구 덕천2길 10 (구포동)</div>'],
    [35.17387829039914, 128.98595281056674, '<div class="infowindow">덕포초등학교<br>	부산광역시 사상구 삼덕로 83 (덕포동)</div>'],
    [35.12331076950321, 128.9746909696025, '<div class="infowindow">동궁초등학교<br>	부산광역시 사상구 엄궁로 70-7 (엄궁동)</div>'],
    [35.14688561014654, 129.005805287697, '<div class="infowindow">동주초등학교<br>	부산광역시 사상구 가야대로306번길 72 (주례동)</div>'],
    [35.214831474979704, 129.02937776497697, '<div class="infowindow">만덕초등학교<br>	부산광역시 북구 만덕1로 72 (만덕동)</div>'],
    [35.22564791584503, 129.01245239355305, '<div class="infowindow">명덕초등학교<br>	부산광역시 북구 금곡대로186번길 43 (화명동)</div>'],
    [35.09355221817028, 128.91208073491993, '<div class="infowindow">명원초등학교<br>	부산광역시 강서구 명지국제6로 147 (명지동)</div>'],
    [35.11124999171344, 128.9225439431641, '<div class="infowindow">명일초등학교<br>	부산광역시 강서구 명지국제5로 170-5 (명지동)</div>'],
    [35.107707055371165, 128.9258624546273, '<div class="infowindow">명지초등학교<br>	부산광역시 강서구 명지국제6로 296</div>'],
    [35.23857329737655, 129.0104360127969, '<div class="infowindow">명진초등학교<br>	부산광역시 북구 화명신도시로 159 (화명동)</div>'],
       
    [35.085102980510534, 128.90028062257286, '<div class="infowindow">명호초등학교<br>	부산광역시 강서구 명지오션시티2로 41 (명지동)</div>'],
    [35.182458468377796, 128.99153882459774, '<div class="infowindow">모덕초등학교<br>	부산광역시 사상구 덕상로 120 (모라동)</div>'],
    [35.18533042057042, 129.0018244170369, '<div class="infowindow">모동초등학교<br>	부산광역시 사상구 모라로192번길 37 (모라동)</div>'],
    [35.19036310182331, 128.98565504703907, '<div class="infowindow">모라초등학교<br>	부산광역시 사상구 모라로64번길 46 (모라동)</div>'],
    [35.1854737357551, 128.99533246436513, '<div class="infowindow">모산초등학교<br>	부산광역시 사상구 모라로110번길 93 (모라동)</div>'],
    [35.15046637043835, 128.94588502223547, '<div class="infowindow">배영초등학교<br>	부산광역시 강서구 공항로339번길 260</div>'],
    [35.21187293459922, 129.03231659385347, '<div class="infowindow">백산초등학교<br>	부산광역시 북구 덕천로259번길 23 (만덕동)</div>'],
    [35.207410211370565, 129.03474277562148, '<div class="infowindow">백양초등학교<br>	부산광역시 북구 상리로18번길 12 (만덕동)</div>'],
    [35.16784559754583, 128.98310347771806, '<div class="infowindow">사상초등학교<br>	부산광역시 사상구 운산로 65 (덕포동)</div>'],
    [35.173786692880235, 128.9787445696051, '<div class="infowindow">삼덕초등학교<br>	부산광역시 사상구 삼덕로 24 (삼락동)</div>'],
       
    [35.218713321011094, 129.0398743022674, '<div class="infowindow">상학초등학교<br>	부산광역시 북구 상학산복길 191 (만덕동)</div>'],
    [35.15750774880851, 128.98231061338598, '<div class="infowindow">서감초등학교<br>	부산광역시 사상구 괘감로 64</div>'],
    [35.18948896690332, 129.2048897047487, '<div class="infowindow">송정초등학교<br>	부산광역시 강서구 신호산단4로 10 (신호동)</div>'],
    [35.250505914001856, 129.0152654040541, '<div class="infowindow">신금초등학교<br>	부산광역시 북구 효열로 42 (금곡동)</div>'],
    [35.20278618794503, 129.03249990755103, '<div class="infowindow">신덕초등학교<br>	부산광역시 북구 함박봉로140번가길 25 (만덕동)</div>'],
    [35.09435183948864, 128.92245088831427, '<div class="infowindow">신명초등학교<br>	부산광역시 강서구 명지국제7로 178 (명지동)</div>'],    
    [35.20032316392788, 129.00846577395183, '<div class="infowindow">신천초등학교<br>	부산광역시 북구 모분재로 83 (구포동)</div>'],
    [35.08195270172714, 128.87841665600232, '<div class="infowindow">신호초등학교<br>	부산광역시 강서구 신호산단2로75번길 12 (신호동)</div>'],
    [35.20614161431089, 129.01120804545468, '<div class="infowindow">양덕초등학교<br>	부산광역시 북구 팽나무로 58 (덕천동)</div>'],
    [35.20962102016024, 129.01873609932176, '<div class="infowindow">양천초등학교<br>	부산광역시 북구 덕천로 132 (덕천동)</div>'],
       
    [35.12914870200816, 128.97424286557535, '<div class="infowindow">엄궁초등학교<br>	부산광역시 사상구 엄궁로191번길 23</div>'],
    [35.07991707072496, 128.90711163056295, '<div class="infowindow">오션초등학교<br>	부산광역시 강서구 명지오션시티6로 72 (명지동)</div>'],
    [35.23116141384862, 129.01754192069419, '<div class="infowindow">와석초등학교<br>	부산광역시 북구 화명대로94번길 83 (화명동)</div>'],
    [35.2288504627717, 129.00885316610075, '<div class="infowindow">용수초등학교<br>	부산광역시 북구 화명신도시로 53 (화명동)</div>'],
    [35.153733591428754, 129.00103231686228, '<div class="infowindow">주감초등학교<br>	부산광역시 사상구 양지로 48</div>'],
    [35.1536679082924, 129.01217726570724, '<div class="infowindow">주양초등학교<br>	부산광역시 사상구 백양대로 372-6 (주례동)</div>'],
    [35.14550262050986, 129.01263134231036, '<div class="infowindow">주학초등학교<br>	부산광역시 사상구 가야대로366번길 120 (주례동)</div>'],
    [35.16578299275197, 128.97765325710623, '<div class="infowindow">창진초등학교<br>	부산광역시 사상구 사상로223번길 100 (괘법동)</div>'],
    [35.05200172805989, 128.8311811249979, '<div class="infowindow">천가초등학교<br>	부산광역시 강서구 동선길 135 (성북동)</div>'],
    [35.19642364671802, 129.00896452435103, '<div class="infowindow">포천초등학교<br>	부산광역시 북구 시랑로 115 (구포동)</div>'],
       
    [35.2311708591284, 129.00812845835196, '<div class="infowindow">학사초등학교<br>	부산광역시 북구 용당로15번길 20</div>'],
    [35.146082167175635, 128.98381727534473, '<div class="infowindow">학장초등학교<br>	부산광역시 사상구 대동로 205 (학장동)</div>'],
    [35.13317599484195, 128.97532457186443, '<div class="infowindow">학진초등학교<br>	부산광역시 사상구 대동로 34-16 (엄궁동</div>'],
    [35.24230404677359, 129.01754690580904, '<div class="infowindow">화명초등학교<br>	부산광역시 북구 대천천길 65 (화명동)</div>'],
    [35.235788155510434, 129.01741161047303, '<div class="infowindow">화잠초등학교<br>	부산광역시 북구 화명대로 97-25 (화명동)</div>'],
    [35.218250475127874, 129.0098144143611, '<div class="infowindow">화정초등학교<br>	부산광역시 북구 의성로 23 (화명동)</div>'],
    [35.08310077845193, 129.00758572961445, '<div class="infowindow">감천초등학교<br>	부산광역시 사하구 원양로 368-2 (감천동)</div>'],
    [35.1038398155849, 129.0297046649812, '<div class="infowindow">광일초등학교<br>	부산광역시 중구 중구로 74 (대청동4가)</div>'],
    [35.103737125256856, 128.99964594302975, '<div class="infowindow">괴정초등학교<br>	부산광역시 사하구 낙동대로 152 (괴정동)</div>'],
    [35.12024533657238, 129.01237452309533, '<div class="infowindow">구덕초등학교<br>	부산광역시 서구 보수대로 312 (서대신동3가)</div>'],
       
    [35.08700528136316, 128.9892660406459, '<div class="infowindow">구평초등학교<br>	부산광역시 사하구 사하로 9 (구평동)</div>'],
    [35.10552840559897, 128.973180550309, '<div class="infowindow">낙동초등학교<br>	부산광역시 사하구 제석로 41 (당리동)</div>'],
    [35.08981924810797, 129.02271902468468, '<div class="infowindow">남부민초등학교<br>	부산광역시 서구 천마로 153 (남부민동)</div>'],
    [35.08338113805189, 129.04335783923378, '<div class="infowindow">남항초등학교<br>	부산광역시 영도구 남항새싹길 55 (영선동4가)</div>'],
    [35.05970361658694, 128.97592335956625, '<div class="infowindow">다대초등학교<br>	부산광역시 사하구 다대로 499 (다대동)</div>'],
    [35.06365471163482, 128.98522098769104, '<div class="infowindow">다선초등학교<br>	부산광역시 사하구 다송로 57 (다대동)</div>'],
    [35.069270155923256, 128.97977029617815, '<div class="infowindow">다송초등학교<br>	부산광역시 사하구 다대로381번길 17 (다대동)</div>'],
    [35.100016616337825, 128.97495672995598, '<div class="infowindow">당리초등학교<br>	부산광역시 사하구 다대로 22번길 12 (당리동)</div>'],
    [35.09494653798797, 129.0461745901861, '<div class="infowindow">대교초등학교<br>	부산광역시 영도구 봉래나루로246번길 19 (봉래동4가)</div>'],
    [35.11569127267958, 129.0118369090911, '<div class="infowindow">대신초등학교<br>	부산광역시 서구 대신로 63 (서대신동3가)</div>'],
       
    [35.08761989834299, 129.03848135175244, '<div class="infowindow">대평초등학교<br>	부산광역시 영도구 절영로 82</div>'],
    [35.079520779045104, 129.07337466309485, '<div class="infowindow">동삼초등학교<br>	부산광역시 영도구 태종로 610 (동삼동)</div>'],
    [35.11404748913898, 129.0177795919865, '<div class="infowindow">동신초등학교<br>	부산광역시 서구 대영로85번길 81-19 (동대신동3가)/div>'],
    [35.05485750774609, 128.96318415561737, '<div class="infowindow">몰운대초등학교<br>	부산광역시 사하구 다대낙조2길 110 (다대동)</div>'],
    [35.084144098910656, 128.96753683171914, '<div class="infowindow">보림초등학교<br>	부산광역시 사하구 장림로161번길 20 (장림동)</div>'],
    [35.105919199447676, 129.02437986282374, '<div class="infowindow">보수초등학교<br>	부산광역시 중구 흑교로 74 (보수동1가)</div>'],
    [35.111492973630156, 129.03612107545322, '<div class="infowindow">봉래초등학교<br>	부산광역시 중구 대영로 226번길 15호 (영주동)</div>'],
    [35.07486236856598, 129.06411032564716, '<div class="infowindow">봉삼초등학교<br>	부산광역시 영도구 함지로79번길 39 (동삼동)</div>'],
    [35.09587033526564, 129.0544848604522, '<div class="infowindow">봉학초등학교<br>	부산광역시 영도구 태종로 242 (청학동)</div>'],
    [35.106697146047935, 129.01950756858378, '<div class="infowindow">부민초등학교<br>	부산광역시 서구 고운들로 12 (부용동2가)</div>'],
       
    [35.09606332424321, 128.98250739816618, '<div class="infowindow">사남초등학교<br>	부산광역시 사하구 장평로 390 (괴정동)</div>'],
    [35.10462881598681, 128.98135388974103, '<div class="infowindow">사동초등학교<br>	부산광역시 사하구 승학로 129-2 (당리동)</div>'],
    [35.099981410262934, 128.98740898970956, '<div class="infowindow">사하초등학교<br>	부산광역시 사하구 낙동대로 266 (괴정동)</div>'],
    [35.08417974159117, 129.0671857538086, '<div class="infowindow">상리초등학교<br>	부산광역시 영도구 상리로 38 (동삼동)</div>'],
    [35.08866896233247, 129.00394962721242, '<div class="infowindow">서천초등학교<br>	부산광역시 사하구 감천로105번길 10 (감천동)</div>'],
    [35.0782129588601, 129.01559876499937, '<div class="infowindow">송도초등학교<br>	부산광역시 서구 충무대로 25 (암남동)</div>'],
    [35.10196123950663, 129.00345156518313, '<div class="infowindow">승학초등학교<br>	부산광역시 사하구 낙동대로135번길 55 (괴정동)</div>'],
    [35.09880615920569, 128.96148656004505, '<div class="infowindow">신남초등학교<br>	부산광역시 사하구 비봉로 88 (하단동)</div>'],
    [35.083224719311914, 129.04737116380187, '<div class="infowindow">신선초등학교<br>	부산광역시 영도구 산정길 17 (신선동3가)</div>'],
    [35.09092255897703, 128.98043764616855, '<div class="infowindow">신촌초등학교<br>	부산광역시 사하구 다대로135번길 34-2</div>'],
       
    [35.094031949656674, 128.9716234701058, '<div class="infowindow">신평초등학교<br>	부산광역시 사하구 장평로299번안길 19 (신평동)</div>'],
    [35.09841324570957, 129.01585506775805, '<div class="infowindow">아미초등학교<br>	부산광역시 서구 해돋이로 241</div>'],
    [35.08975122030314, 129.0460994993009, '<div class="infowindow">영도초등학교<br>	부산광역시 영도구 꿈나무길 41 (신선동1가)</div>'],
    [35.093442851705426, 128.99348036886616, '<div class="infowindow">옥천초등학교<br>	부산광역시 사하구 사하로 134 (감천동)</div>'],
    [35.11536534303109, 128.96136310878367, '<div class="infowindow">을숙도초등학교<br>	부산광역시 사하구 낙동대로 581 (하단동)</div>'],
    [35.05297197445521, 128.96547238517883, '<div class="infowindow">응봉초등학교<br>	부산광역시 사하구 다대낙조2길 26 (다대동)</div>'],
    [35.08181140704257, 128.97611971343895, '<div class="infowindow">장림초등학교<br>	부산광역시 사하구 장림번영로103번길 10 (장림동)</div>'],
    [35.072911166164864, 129.06300897425646, '<div class="infowindow">절영초등학교<br>	부산광역시 영도구 함지로 37 (동삼동)</div>'],
    [35.074046015644385, 129.07035026546734, '<div class="infowindow">중리초등학교<br>	부산광역시 영도구 와치로 286 (동삼동)</div>'],
    [35.050872604495254, 128.9668333079124, '<div class="infowindow">중현초등학교<br>	부산광역시 사하구 다대낙조2길 8 (다대동)</div>'],
       
    [35.08152737439608, 129.01818373206095, '<div class="infowindow">천마초등학교<br>	부산광역시 서구 천해로7번길 38 (암남동)</div>'],
    [35.08808730739832, 129.06723201487915, '<div class="infowindow">청동초등학교<br>	부산광역시 영도구 태종로422번길 51 (청학동)</div>'],
    [35.09299565269777, 129.05906756512107, '<div class="infowindow">청학초등학교<br>	부산광역시 영도구 청학로 49</div>'],
    [35.065664067852005, 129.078962222283, '<div class="infowindow">태종대초등학교<br>	부산광역시 영도구 태종로 802</div>'],
    [35.098636146442466, 129.02133983857783, '<div class="infowindow">토성초등학교<br>	부산광역시 서구 구덕로134번길 45 (토성동2가)</div>'],
    [35.09940004363904, 128.9599730331142, '<div class="infowindow">하남초등학교<br>	부산광역시 사하구 하신번영로 186 (하단동)</div>'],
    [35.105279766627454, 128.96445579492033, '<div class="infowindow">하단초등학교<br>	부산광역시 사하구 하신중앙로 321 (하단동)</div>'],
    [35.10855890540586, 129.02104471320834, '<div class="infowindow">화랑초등학교<br>	부산광역시 서구 대영로86번길 56</div>'],
    [35.07598768095621, 128.97383543176545, '<div class="infowindow">효림초등학교<br>	부산광역시 사하구 장평로 106 (장림동)</div>'],
    [35.10424216315885, 129.033144697423, '<div class="infowindow">남성초등학교<br>	부산광역시 중구 샘길 14 (대청동1가)</div>'],
       
    [35.08333403406751, 129.0161779652243, '<div class="infowindow">부산알로이시오초등학교<br>	부산광역시 서구 천해로13번길 16-9 (암남동)</div>'],
    [35.32676343105143, 129.1775794234095, '<div class="infowindow">가동초등학교<br>	부산광역시 기장군 정관읍 정관5로 100 (정관읍)</div>'],
    [35.172101645122886, 129.1367629179438, '<div class="infowindow">강동초등학교<br>	부산광역시 해운대구 해운대로349번길 10 (우동)</div>'],
    [35.14548581947102, 129.1141302004137, '<div class="infowindow">광남초등학교<br>	부산광역시 수영구 광안해변로 115 (남천동)</div>'],
    [35.157115079181196, 129.1167788919977, '<div class="infowindow">광안초등학교<br>	부산광역시 수영구 광안로35번길 42 (광안동)</div>'],
    [35.254787369923136, 129.21639863400807, '<div class="infowindow">교리초등학교<br>	부산광역시 기장군 기장읍 차성로 427</div>'],
    [35.24606866420134, 129.2118179102468, '<div class="infowindow">기장초등학교<br>	부산광역시 기장군 기장읍 읍내로 69 (기장읍)</div>'],
    [35.14357909390845, 129.1074760708536, '<div class="infowindow">남천초등학교<br>	부산광역시 수영구 남천서로 14 (남천동)</div>'],
    [35.205523201785994, 129.20542425257216, '<div class="infowindow">내리초등학교<br>	부산광역시 기장군 기장읍 소정안길 50 (기장읍)</div>'],
    [35.31918876212821, 129.18732309500587, '<div class="infowindow">달산초등학교<br>	부산광역시 기장군 정관읍 정관로 674</div>'],
       
    [35.23506255586604, 129.21004422566375, '<div class="infowindow">대청초등학교<br>	부산광역시 기장군 기장읍 차성서로 31 (기장읍)</div>'],
    [35.16404080989069, 129.18111605718624, '<div class="infowindow">동백초등학교<br>	부산광역시 해운대구 좌동순환로357번길 6</div>'],
    [35.17558930068881, 129.11454266183208, '<div class="infowindow">망미초등학교<br>	부산광역시 수영구 수미로35번길 27</div>'],
    [35.33896788266456, 129.16212144532756, '<div class="infowindow">모전초등학교<br>	부산광역시 기장군 정관읍 정관1로 17</div>'],
    [35.197859796788904, 129.1237082132443, '<div class="infowindow">무정초등학교<br>	부산광역시 해운대구 반여로 68-11</div>'],
    [35.160737621284404, 129.1269865421829, '<div class="infowindow">민락초등학교<br>	부산광역시 수영구 광남로257번길 12 (민락동)</div>'],
    [35.16304884236043, 129.12138222360693, '<div class="infowindow">민안초등학교<br>	부산광역시 수영구 감포로38번길 33 (민락동)</div>'],
    [35.19337882994737, 129.128887834539, '<div class="infowindow">반산초등학교<br>	부산광역시 해운대구 재반로 171 (재송동)</div>'],
    [35.21133361997792, 129.12504280769537, '<div class="infowindow">반석초등학교<br>	부산광역시 해운대구 선수촌로207번길 14 (반여동)</div>'],
    [35.22356350122241, 129.14752683204014, '<div class="infowindow">반송초등학교<br>	부산광역시 해운대구 아랫반송로30번길 37-16 (반송동) 반송초등학교</div>'],

    [35.202727821471974, 129.1132218339193, '<div class="infowindow">반안초등학교<br>	부산광역시 해운대구 명장로67번길 40-42</div>'],
    [35.2026452866095, 129.12945233039483, '<div class="infowindow">반여초등학교<br>	부산광역시 해운대구 재반로 301</div>'],
    [35.322831573250774, 129.1867264834583, '<div class="infowindow">방곡초등학교<br>	부산광역시 기장군 정관면 정관덕산길 61 (정관면)</div>'],
    [35.177525938481416, 129.10218437950874, '<div class="infowindow">배산초등학교<br>	부산광역시 수영구 망미배산로48번길 85-15 (망미동)</div>'],
    [35.17528084671227, 129.1781794291997, '<div class="infowindow">부흥초등학교<br>	부산광역시 해운대구 좌동순환로 216 (좌동)</div>'],
    [35.20862684913066, 129.11591858157027, '<div class="infowindow">삼어초등학교<br>	부산광역시 해운대구 삼어로91번길 73 (반여동)</div>'],
    [35.179766899196586, 129.17616168525907, '<div class="infowindow">상당초등학교<br>	부산광역시 해운대구 세실로 173 (좌동)</div>'],
    [35.180960649144474, 129.12195295856466, '<div class="infowindow">센텀초등학교<br>	부산광역시 해운대구 센텀중앙로 166</div>'],
    [35.18978333115101, 129.11923965246405, '<div class="infowindow">송수초등학교<br>	부산광역시 해운대구 해운대로76번길 35 (재송동)</div>'],
    [35.22866976107938, 129.1572265022445, '<div class="infowindow">송운초등학교<br>	부산광역시 해운대구 신반송로 20 (반송동)</div>'],
    
    [35.1894462490444, 129.20495014129102, '<div class="infowindow">송정초등학교<br>	부산광역시 해운대구 해운대로 1164-9</div>'],
    [35.16861473970322, 129.10392919668908, '<div class="infowindow">수미초등학교<br>	부산광역시 수영구 연수로310번길 91 (망미동)</div>'],
    [35.165841675462964, 129.11236298913832, '<div class="infowindow">수영초등학교<br>	부산광역시 수영구 광서로16번길 33 (광안동)</div>'],
    [35.16994307203998, 129.1819127094077, '<div class="infowindow">신곡초등학교<br>	부산광역시 해운대구 좌동순환로 290 (좌동)</div>'],
    [35.16932940895561, 129.1673453868693, '<div class="infowindow">신도초등학교<br>	부산광역시 해운대구 좌동순환로 34 (좌동)</div>'],
    [35.191236767650004, 129.12272352949455, '<div class="infowindow">신재초등학교<br>	부산광역시 해운대구 해운대로81번길 55</div>'],
    [35.32846430844447, 129.1676550594027, '<div class="infowindow">신정초등학교<br>	부산광역시 기장군 정관읍 정관로 460 (정관읍)</div>'],
    [35.240744247132724, 129.17149215821766, '<div class="infowindow">신진초등학교<br>	부산광역시 기장군 철마면 고촌로28번길 10 (철마면)</div>'],
    [35.174511904491666, 129.1665364730935, '<div class="infowindow">양운초등학교<br>	부산광역시 해운대구 대천로67번길 36 (좌동)</div>'],
    [35.22507751231922, 129.2267797648997, '<div class="infowindow">용암초등학교<br>	부산광역시 기장군 기장읍 기장해안로 577</div>'],
    
    [35.228831917659036, 129.15952259577784, '<div class="infowindow">운봉초등학교<br>	부산광역시 해운대구 신반송로 11-20</div>'],
    [35.22885959415376, 129.14627415607129, '<div class="infowindow">운송초등학교<br>	부산광역시 해운대구 반송로 839 (반송동)</div>'],
    [35.32790800685454, 129.28294877204274, '<div class="infowindow">월내초등학교<br>	부산광역시 기장군 장안읍 길천2길 25 (장안읍)</div>'],
    [35.3599573588832, 129.13855420777196, '<div class="infowindow">월평초등학교<br>	부산광역시 기장군 정관읍 월평1길 21 (정관읍)</div>'],
    [35.202616745794764, 129.12524426429587, '<div class="infowindow">인지초등학교<br>	부산광역시 해운대구 반여로 128 (반여동)</div>'],
    [35.27939235115055, 129.2315043124882, '<div class="infowindow">일광초등학교<br>	부산광역시 기장군 일광면 해빛로 46 (일광면)</div>'],
    [35.199894668770945, 129.12009256247583, '<div class="infowindow">장산초등학교<br>	부산광역시 해운대구 선수촌로 68 (반여동)</div>'],
    [35.346438868039655, 129.25386659139488, '<div class="infowindow">장안초등학교<br>	부산광역시 기장군 장안읍 장안로 67-4 (장안읍)</div>'],
    [35.1865769033374, 129.12767266964602, '<div class="infowindow">재송초등학교<br>	부산광역시 해운대구 재반로64번길 33 (재송동)</div>'],
    [35.32301767673393, 129.17153701576026, '<div class="infowindow">정관초등학교<br>	부산광역시 기장군 정관읍 정관로 530</div>'],
    
    [35.33225380539794, 129.16735538320304, '<div class="infowindow">정원초등학교<br>	부산광역시 기장군 정관읍 정관로 423</div>'],
    [35.17556855394353, 129.17511333371309, '<div class="infowindow">좌동초등학교<br>	부산광역시 해운대구 세실로 127 (좌동)</div>'],
    [35.16912542521948, 129.18409180010505, '<div class="infowindow">좌산초등학교<br>	부산광역시 해운대구 좌동순환로311번길 7 (좌동)</div>'],
    [35.311907742840226, 129.24039265803924, '<div class="infowindow">좌천초등학교<br>	부산광역시 기장군 장안읍 좌천로 13-66</div>'],
    [35.24265357210411, 129.24377217128216, '<div class="infowindow">죽성초등학교<br>	부산광역시 기장군 기장읍 죽성로 270 (기장읍)</div>'],
    [35.27521433623847, 129.1509577538955, '<div class="infowindow">철마초등학교<br>	부산광역시 기장군 철마면 철마로 493 (철마면)</div>'],
    [35.29884969620479, 129.25544963685158, '<div class="infowindow">칠암초등학교<br>	부산광역시 기장군 일광면 박영준길 19 (일광면)</div>'],
    [35.16193890795181, 129.14147482113017, '<div class="infowindow">해강초등학교<br>	부산광역시 해운대구 해운대해변로 73 (우동)</div>'],
    [35.17015155240781, 129.15534166547755, '<div class="infowindow">해동초등학교<br>	부산광역시 해운대구 우동1로 104 (우동)</div>'],
    [35.1650756587863, 129.14379268063465, '<div class="infowindow">해림초등학교<br>	부산광역시 해운대구 해운대로469번길 42 (우동)</div>'],
    
    [35.26416512989423, 129.22246352621127, '<div class="infowindow">해빛초등학교<br>	부산광역시 기장군 일광면 해빛6로 9</div>'],
    [35.164379599225164, 129.17948420831723, '<div class="infowindow">해송초등학교<br>	부산광역시 해운대구 좌동순환로402번길 32 (좌동)</div>'],
    [35.16472140924061, 129.16607466395922, '<div class="infowindow">해운대초등학교<br>	부산광역시 해운대구 중동2로24번길 30 (중동)</div>'],
    [35.15880530783175, 129.14406448881286, '<div class="infowindow"해원초등학교<br>	부산광역시 해운대구 마린시티2로 10 (우동)</div>'],
    [35.154197723689094, 129.11037819289413, '<div class="infowindow">호암초등학교<br>	부산광역시 수영구 호암로29번길 57</div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],

    
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],

    
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],
    [, '<div class="infowindow"></div>'],

];


  // 지도에 마커를 생성하고 표시한다
for (var i=0; i<places.length; i++) {
  var marker = new kakao.maps.Marker({
    position: new kakao.maps.LatLng(places[i][0], places[i][1]), // 마커의 좌표
    map: map, // 마커를 표시할 지도 객체
    image: markerImage // 마커이미지 설정
  });

// 마커가 지도 위에 표시되도록 설정합니다
marker.setMap(map); 

  // 마커 위에 표시할 인포윈도우를 생성한다
  var infowindow = new kakao.maps.InfoWindow({
    content : places[i][2]
  });

  // 인포윈도우를 지도에 표시한다
  markers.push(marker);

  // 마커에 mouseover 이벤트와 mouseout 이벤트를 등록합니다
  // 이벤트 리스너로는 클로저를 만들어 등록합니다 
   // for문에서 클로저를 만들어 주지 않으면 마지막 마커에만 이벤트가 등록됩니다
  kakao.maps.event.addListener(
     marker, 
    'mouseover', 
    makeOverListener(map, marker, infowindow)
  );
  kakao.maps.event.addListener(
    marker, 
    'mouseout', 
    makeOutListener(infowindow)
  );

  // 클러스터러에 마커들을 추가합니다
  clusterer.addMarkers(markers);

  // 인포윈도우를 표시하는 클로저를 만드는 함수입니다 
  function makeOverListener(map, marker, infowindow) {
    return function() {
      infowindow.open(map, marker);
    };
  }

  // 인포윈도우를 닫는 클로저를 만드는 함수입니다 
  function makeOutListener(infowindow) {
    return function() {
        infowindow.close();
    };
  }
}



















// /*장소 검색*/
// 장소 검색 객체를 생성합니다
var ps = new kakao.maps.services.Places();  

// // 검색 결과 목록이나 마커를 클릭했을 때 장소명을 표출할 인포윈도우를 생성합니다
var infowindow = new kakao.maps.InfoWindow({zIndex:1});

// 키워드로 장소를 검색합니다
searchPlaces();

// 키워드 검색을 요청하는 함수입니다
function searchPlaces() {

    var keyword = document.getElementById('keyword').value;

    if (!keyword.replace(/^\s+|\s+$/g, '')) {
        alert('키워드를 입력해주세요!');
        return false;
    }

    // 장소검색 객체를 통해 키워드로 장소검색을 요청합니다
    ps.keywordSearch( keyword, placesSearchCB); 
}

// 장소검색이 완료됐을 때 호출되는 콜백함수 입니다
function placesSearchCB(data, status, pagination) {
    if (status === kakao.maps.services.Status.OK) {

        // 정상적으로 검색이 완료됐으면
        // 검색 목록과 마커를 표출합니다
        displayPlaces(data);

        // 페이지 번호를 표출합니다
        displayPagination(pagination);

    } else if (status === kakao.maps.services.Status.ZERO_RESULT) {

        alert('검색 결과가 존재하지 않습니다.');
        return;

    } else if (status === kakao.maps.services.Status.ERROR) {

        alert('검색 결과 중 오류가 발생했습니다.');
        return;

    }
}

// 검색 결과 목록과 마커를 표출하는 함수입니다
function displayPlaces(places) {

    var listEl = document.getElementById('placesList'), 
    menuEl = document.getElementById('menu_wrap'),
    fragment = document.createDocumentFragment(), 
    bounds = new kakao.maps.LatLngBounds(), 
    listStr = '8';
    
    // 검색 결과 목록에 추가된 항목들을 제거합니다
    removeAllChildNods(listEl);

    // 지도에 표시되고 있는 마커를 제거합니다
    removeMarker();
    
    for ( var i=0; i<places.length; i++ ) {

        // 마커를 생성하고 지도에 표시합니다
        var placePosition = new kakao.maps.LatLng(places[i].y, places[i].x),
            marker = addMarker(placePosition, i), 
            itemEl = getListItem(i, places[i]); // 검색 결과 항목 Element를 생성합니다

        // 검색된 장소 위치를 기준으로 지도 범위를 재설정하기위해
        // LatLngBounds 객체에 좌표를 추가합니다
        bounds.extend(placePosition);

        // 마커와 검색결과 항목에 mouseover 했을때
        // 해당 장소에 인포윈도우에 장소명을 표시합니다
        // mouseout 했을 때는 인포윈도우를 닫습니다
        (function(marker, title) {
            kakao.maps.event.addListener(marker, 'mouseover', function() {
                displayInfowindow(marker, title);
            });

            kakao.maps.event.addListener(marker, 'mouseout', function() {
                infowindow.close();
            });

            itemEl.onmouseover =  function () {
                displayInfowindow(marker, title);
            };

            itemEl.onmouseout =  function () {
                infowindow.close();
            };
        })(marker, places[i].place_name);

        fragment.appendChild(itemEl);
    }

    // 검색결과 항목들을 검색결과 목록 Elemnet에 추가합니다
    listEl.appendChild(fragment);
    menuEl.scrollTop = 0;

    // 검색된 장소 위치를 기준으로 지도 범위를 재설정합니다
    map.setBounds(bounds);
}

// 검색결과 항목을 Element로 반환하는 함수입니다
function getListItem(index, places) {

    var el = document.createElement('li'),
    itemStr = '<span class="markerbg marker_' + (index+1) + '"></span>' +
                '<div class="info">' +
                '   <h5>' + places.place_name + '</h5>';

    if (places.road_address_name) {
        itemStr += '    <span>' + places.road_address_name + '</span>' +
                    '   <span class="jibun gray">' +  places.address_name  + '</span>';
    } else {
        itemStr += '    <span>' +  places.address_name  + '</span>'; 
    }
                 
      itemStr += '  <span class="tel">' + places.phone  + '</span>' +
                '</div>';           

    el.innerHTML = itemStr;
    el.className = 'item';

    return el;
}

// 마커를 생성하고 지도 위에 마커를 표시하는 함수입니다
function addMarker(position, idx, title) {
    var imageSrc = 'https://t1.daumcdn.net/localimg/localimages/07/mapapidoc/marker_number_blue.png', // 마커 이미지 url, 스프라이트 이미지를 씁니다
        imageSize = new kakao.maps.Size(36, 37),  // 마커 이미지의 크기
        imgOptions =  {
            spriteSize : new kakao.maps.Size(36, 691), // 스프라이트 이미지의 크기
            spriteOrigin : new kakao.maps.Point(0, (idx*46)+10), // 스프라이트 이미지 중 사용할 영역의 좌상단 좌표
            offset: new kakao.maps.Point(13, 37) // 마커 좌표에 일치시킬 이미지 내에서의 좌표
        },
        markerImage = new kakao.maps.MarkerImage(imageSrc, imageSize, imgOptions),
            marker = new kakao.maps.Marker({
            position: position, // 마커의 위치
            image: markerImage 
        });

    marker.setMap(map); // 지도 위에 마커를 표출합니다
    markers.push(marker);  // 배열에 생성된 마커를 추가합니다

    return marker;
}

// 지도 위에 표시되고 있는 마커를 모두 제거합니다
function removeMarker() {
    for ( var i = 0; i < markers.length; i++ ) {
        markers[i].setMap(null);
    }   
    markers = [];
}

// 검색결과 목록 하단에 페이지번호를 표시는 함수입니다
function displayPagination(pagination) {
    var paginationEl = document.getElementById('pagination'),
        fragment = document.createDocumentFragment(),
        i; 

    // 기존에 추가된 페이지번호를 삭제합니다
    while (paginationEl.hasChildNodes()) {
        paginationEl.removeChild (paginationEl.lastChild);
    }

    for (i=1; i<=pagination.last; i++) {
        var el = document.createElement('a');
        el.href = "#";
        el.innerHTML = i;

        if (i===pagination.current) {
            el.className = 'on';
        } else {
            el.onclick = (function(i) {
                return function() {
                    pagination.gotoPage(i);
                }
            })(i);
        }

        fragment.appendChild(el);
    }
    paginationEl.appendChild(fragment);
}

// 검색결과 목록 또는 마커를 클릭했을 때 호출되는 함수입니다
// 인포윈도우에 장소명을 표시합니다
function displayInfowindow(marker, title) {
    var content = '<div style="padding:5px;z-index:1;">' + title + '</div>';

    infowindow.setContent(content);
    infowindow.open(map, marker);
}

 // 검색결과 목록의 자식 Element를 제거하는 함수입니다
function removeAllChildNods(el) {   
    while (el.hasChildNodes()) {
        el.removeChild (el.lastChild);
    }
}

/*현재 위치에서 접속*/

// HTML5의 geolocation으로 사용할 수 있는지 확인합니다 
	    if (navigator.geolocation) {
	        
	        // GeoLocation을 이용해서 접속 위치를 얻어옵니다
	        navigator.geolocation.getCurrentPosition(function(position) {
	            
	            var lat = position.coords.latitude, // 위도
	                lon = position.coords.longitude; // 경도
	            
	            var locPosition = new kakao.maps.LatLng(lat, lon), // 마커가 표시될 위치를 geolocation으로 얻어온 좌표로 생성합니다
	                message = '<div style="padding:5px;">현재위치</div>'; // 인포윈도우에 표시될 내용입니다
	            
	            // 마커와 인포윈도우를 표시합니다
	            displayMarker(locPosition, message);
	                
	          });
	        
	     // 지도에 마커와 인포윈도우를 표시하는 함수입니다
	        function displayMarker(locPosition, message) {

	            // 마커를 생성합니다
	            var marker_present = new kakao.maps.Marker({  
	                map: map, 
	                position: locPosition
	            }); 
	            
	            var iwContent = message, // 인포윈도우에 표시할 내용
	                iwRemoveable = true;

	            // 인포윈도우를 생성합니다
	            var infowindow = new kakao.maps.InfoWindow({
	                content : iwContent,
	                removable : iwRemoveable
	            });
	            
	            // 인포윈도우를 마커위에 표시합니다 
	            infowindow.open(map, marker_present);
	            
	            // 지도 중심좌표를 접속위치로 변경합니다
	            map.setCenter(locPosition);      
	        }    
	        
	    } 














        // 주소-좌표 변환 객체를 생성합니다
var geocoder = new kakao.maps.services.Geocoder();







// /*거리 측정 */
//선 그리기 
var drawingFlag = false; // 선이 그려지고 있는 상태를 가지고 있을 변수입니다
var moveLine; // 선이 그려지고 있을때 마우스 움직임에 따라 그려질 선 객체 입니다
var clickLine // 마우스로 클릭한 좌표로 그려질 선 객체입니다
var distanceOverlay; // 선의 거리정보를 표시할 커스텀오버레이 입니다
var dots = {}; // 선이 그려지고 있을때 클릭할 때마다 클릭 지점과 거리를 표시하는 커스텀 오버레이 배열입니다.

// 지도에 클릭 이벤트를 등록합니다
// 지도를 클릭하면 선 그리기가 시작됩니다 그려진 선이 있으면 지우고 다시 그립니다
kakao.maps.event.addListener(map, 'click', function(mouseEvent) {

    // 마우스로 클릭한 위치입니다 
    var clickPosition = mouseEvent.latLng;

    // 지도 클릭이벤트가 발생했는데 선을 그리고있는 상태가 아니면
    if (!drawingFlag) {

        // 상태를 true로, 선이 그리고있는 상태로 변경합니다
        drawingFlag = true;
        
        // 지도 위에 선이 표시되고 있다면 지도에서 제거합니다
        deleteClickLine();
        
        // 지도 위에 커스텀오버레이가 표시되고 있다면 지도에서 제거합니다
        deleteDistnce();

        // 지도 위에 선을 그리기 위해 클릭한 지점과 해당 지점의 거리정보가 표시되고 있다면 지도에서 제거합니다
        deleteCircleDot();
    
        // 클릭한 위치를 기준으로 선을 생성하고 지도위에 표시합니다
        clickLine = new kakao.maps.Polyline({
            map: map, // 선을 표시할 지도입니다 
            path: [clickPosition], // 선을 구성하는 좌표 배열입니다 클릭한 위치를 넣어줍니다
            strokeWeight: 3, // 선의 두께입니다 
            strokeColor: '#db4040', // 선의 색깔입니다
            strokeOpacity: 1, // 선의 불투명도입니다 0에서 1 사이값이며 0에 가까울수록 투명합니다
            strokeStyle: 'solid' // 선의 스타일입니다
        });
        
        // 선이 그려지고 있을 때 마우스 움직임에 따라 선이 그려질 위치를 표시할 선을 생성합니다
        moveLine = new kakao.maps.Polyline({
            strokeWeight: 3, // 선의 두께입니다 
            strokeColor: '#db4040', // 선의 색깔입니다
            strokeOpacity: 0.5, // 선의 불투명도입니다 0에서 1 사이값이며 0에 가까울수록 투명합니다
            strokeStyle: 'solid' // 선의 스타일입니다    
        });
    
        // 클릭한 지점에 대한 정보를 지도에 표시합니다
        displayCircleDot(clickPosition, 0);

            
    } else { // 선이 그려지고 있는 상태이면

        // 그려지고 있는 선의 좌표 배열을 얻어옵니다
        var path = clickLine.getPath();

        // 좌표 배열에 클릭한 위치를 추가합니다
        path.push(clickPosition);
        
        // 다시 선에 좌표 배열을 설정하여 클릭 위치까지 선을 그리도록 설정합니다
        clickLine.setPath(path);

        var distance = Math.round(clickLine.getLength());
        displayCircleDot(clickPosition, distance);
    }
});
    
// 지도에 마우스무브 이벤트를 등록합니다
// 선을 그리고있는 상태에서 마우스무브 이벤트가 발생하면 그려질 선의 위치를 동적으로 보여주도록 합니다
kakao.maps.event.addListener(map, 'mousemove', function (mouseEvent) {

    // 지도 마우스무브 이벤트가 발생했는데 선을 그리고있는 상태이면
    if (drawingFlag){
        
        // 마우스 커서의 현재 위치를 얻어옵니다 
        var mousePosition = mouseEvent.latLng; 

        // 마우스 클릭으로 그려진 선의 좌표 배열을 얻어옵니다
        var path = clickLine.getPath();
        
        // 마우스 클릭으로 그려진 마지막 좌표와 마우스 커서 위치의 좌표로 선을 표시합니다
        var movepath = [path[path.length-1], mousePosition];
        moveLine.setPath(movepath);    
        moveLine.setMap(map);
        
        var distance = Math.round(clickLine.getLength() + moveLine.getLength()), // 선의 총 거리를 계산합니다
            content = '<div class="dotOverlay distanceInfo">총거리 <span class="number">' + distance + '</span>m</div>'; // 커스텀오버레이에 추가될 내용입니다
        
        // 거리정보를 지도에 표시합니다
        showDistance(content, mousePosition);   
    }             
});                 

// 지도에 마우스 오른쪽 클릭 이벤트를 등록합니다
// 선을 그리고있는 상태에서 마우스 오른쪽 클릭 이벤트가 발생하면 선 그리기를 종료합니다
kakao.maps.event.addListener(map, 'rightclick', function (mouseEvent) {

    // 지도 오른쪽 클릭 이벤트가 발생했는데 선을 그리고있는 상태이면
    if (drawingFlag) {
        
        // 마우스무브로 그려진 선은 지도에서 제거합니다
        moveLine.setMap(null);
        moveLine = null;  
        
        // 마우스 클릭으로 그린 선의 좌표 배열을 얻어옵니다
        var path = clickLine.getPath();
    
        // 선을 구성하는 좌표의 개수가 2개 이상이면
        if (path.length > 1) {

            // 마지막 클릭 지점에 대한 거리 정보 커스텀 오버레이를 지웁니다
            if (dots[dots.length-1].distance) {
                dots[dots.length-1].distance.setMap(null);
                dots[dots.length-1].distance = null;    
            }

            var distance = Math.round(clickLine.getLength()), // 선의 총 거리를 계산합니다
                content = getTimeHTML(distance); // 커스텀오버레이에 추가될 내용입니다
                
            // 그려진 선의 거리정보를 지도에 표시합니다
            showDistance(content, path[path.length-1]);  
             
        } else {

            // 선을 구성하는 좌표의 개수가 1개 이하이면 
            // 지도에 표시되고 있는 선과 정보들을 지도에서 제거합니다.
            deleteClickLine();
            deleteCircleDot(); 
            deleteDistnce();

        }
        
        // 상태를 false로, 그리지 않고 있는 상태로 변경합니다
        drawingFlag = false;          
    }  
});    

// 클릭으로 그려진 선을 지도에서 제거하는 함수입니다
function deleteClickLine() {
    if (clickLine) {
        clickLine.setMap(null);    
        clickLine = null;        
    }
}

// 마우스 드래그로 그려지고 있는 선의 총거리 정보를 표시하거
// 마우스 오른쪽 클릭으로 선 그리가 종료됐을 때 선의 정보를 표시하는 커스텀 오버레이를 생성하고 지도에 표시하는 함수입니다
function showDistance(content, position) {
    
    if (distanceOverlay) { // 커스텀오버레이가 생성된 상태이면
        
        // 커스텀 오버레이의 위치와 표시할 내용을 설정합니다
        distanceOverlay.setPosition(position);
        distanceOverlay.setContent(content);
        
    } else { // 커스텀 오버레이가 생성되지 않은 상태이면
        
        // 커스텀 오버레이를 생성하고 지도에 표시합니다
        distanceOverlay = new kakao.maps.CustomOverlay({
            map: map, // 커스텀오버레이를 표시할 지도입니다
            content: content,  // 커스텀오버레이에 표시할 내용입니다
            position: position, // 커스텀오버레이를 표시할 위치입니다.
            xAnchor: 0,
            yAnchor: 0,
            zIndex: 3  
        });      
    }
}

// 그려지고 있는 선의 총거리 정보와 
// 선 그리가 종료됐을 때 선의 정보를 표시하는 커스텀 오버레이를 삭제하는 함수입니다
function deleteDistnce () {
    if (distanceOverlay) {
        distanceOverlay.setMap(null);
        distanceOverlay = null;
    }
}

// 선이 그려지고 있는 상태일 때 지도를 클릭하면 호출하여 
// 클릭 지점에 대한 정보 (동그라미와 클릭 지점까지의 총거리)를 표출하는 함수입니다
function displayCircleDot(position, distance) {

    // 클릭 지점을 표시할 빨간 동그라미 커스텀오버레이를 생성합니다
    var circleOverlay = new kakao.maps.CustomOverlay({
        content: '<span class="dot"></span>',
        position: position,
        zIndex: 1
    });

    // 지도에 표시합니다
    circleOverlay.setMap(map);

    if (distance > 0) {
        // 클릭한 지점까지의 그려진 선의 총 거리를 표시할 커스텀 오버레이를 생성합니다
        var distanceOverlay = new kakao.maps.CustomOverlay({
            content: '<div class="dotOverlay">거리 <span class="number">' + distance + '</span>m</div>',
            position: position,
            yAnchor: 1,
            zIndex: 2
        });

        // 지도에 표시합니다
        distanceOverlay.setMap(map);
    }

    // 배열에 추가합니다
    dots.push({circle:circleOverlay, distance: distanceOverlay});
}

// 클릭 지점에 대한 정보 (동그라미와 클릭 지점까지의 총거리)를 지도에서 모두 제거하는 함수입니다
function deleteCircleDot() {
    var i;

    for ( i = 0; i < dots.length; i++ ){
        if (dots[i].circle) { 
            dots[i].circle.setMap(null);
        }

        if (dots[i].distance) {
            dots[i].distance.setMap(null);
        }
    }

    dots = [];
}

// 마우스 우클릭 하여 선 그리기가 종료됐을 때 호출하여 
// 그려진 선의 총거리 정보와 거리에 대한 도보, 자전거 시간을 계산하여
// HTML Content를 만들어 리턴하는 함수입니다
function getTimeHTML(distance) {

    // 도보의 시속은 평균 4km/h 이고 도보의 분속은 67m/min입니다
    var walkkTime = distance / 67 | 0;
    var walkHour = '', walkMin = '';

    // 계산한 도보 시간이 60분 보다 크면 시간으로 표시합니다
    if (walkkTime > 60) {
        walkHour = '<span class="number">' + Math.floor(walkkTime / 60) + '</span>시간 '
    }
    walkMin = '<span class="number">' + walkkTime % 60 + '</span>분'

    // 자전거의 평균 시속은 16km/h 이고 이것을 기준으로 자전거의 분속은 267m/min입니다
    var bycicleTime = distance / 227 | 0;
    var bycicleHour = '', bycicleMin = '';

    // 계산한 자전거 시간이 60분 보다 크면 시간으로 표출합니다
    if (bycicleTime > 60) {
        bycicleHour = '<span class="number">' + Math.floor(bycicleTime / 60) + '</span>시간 '
    }
    bycicleMin = '<span class="number">' + bycicleTime % 60 + '</span>분'

    // 거리와 도보 시간, 자전거 시간을 가지고 HTML Content를 만들어 리턴합니다
    var content = '<ul class="dotOverlay distanceInfo">';
    content += '    <li>';
    content += '        <span class="label">총거리</span><span class="number">' + distance + '</span>m';
    content += '    </li>';
    content += '    <li>';
    content += '        <span class="label">도보</span>' + walkHour + walkMin;
    content += '    </li>';
    content += '    <li>';
    content += '        <span class="label">자전거</span>' + bycicleHour + bycicleMin;
    content += '    </li>';
    content += '</ul>'

    return content;
}